Emacs.org
#+TITLE: My own GNU Emacs Config
#+AUTHOR: Luis Henrique
#+DESCRIPTION: My personal vanilla Emacs config.
#+PROPERTY: header-args:emacs-lisp :tangle .emacs.d/init.el :mkdirp yes
#+PROPERTY: header-args:scheme :noweb-ref packages :noweb-sep ""

* Table of Contents
:PROPERTIES:
:TOC:      :include all :ignore this
:END:
:CONTENTS:
- [[#about-this-config][About This Config]]
- [[#setting-up-a-literate-config][Setting Up a Literate Config]]
- [[#startup-performance][Startup Performance]]
- [[#global-mappings][Global Mappings]]
  - [[#esc-cancels-commands][ESC cancels commands]]
- [[#package-management][Package Management]]
  - [[#general-package-setup-packageel][General package setup (package.el)]]
  - [[#straightel][straight.el]]
  - [[#guix][guix]]
  - [[#use-package-setup][use-package setup]]
    - [[#packageel-setup][package.el setup]]
    - [[#straightel-setup][straight.el setup]]
- [[#keep-emacsd-clean][Keep .emacs.d Clean]]
- [[#update-load-path][Update Load Path]]
- [[#desktop-environment][Desktop Environment]]
- [[#key-bindings][Key Bindings]]
  - [[#dark-side-evil][Dark Side (Evil)]]
    - [[#evil][Evil]]
    - [[#enhancing-evil][Enhancing evil]]
      - [[#evil-collection][evil-collection]]
      - [[#evil-nerd-commenter][evil-nerd-commenter]]
  - [[#generalel][general.el]]
  - [[#hydra][Hydra]]
  - [[#which-key][which-key]]
- [[#completion][Completion]]
  - [[#old-setup-ivy][Old Setup (Ivy)]]
    - [[#ivy][Ivy]]
    - [[#counsel][Counsel]]
    - [[#navigation-bindings][Navigation bindings]]
    - [[#helpful][Helpful]]
  - [[#vertico][Vertico]]
  - [[#consult][Consult]]
  - [[#marginalia][Marginalia]]
  - [[#corfu][Corfu]]
  - [[#orderless][Orderless]]
  - [[#embark][Embark]]
  - [[#helpful][Helpful]]
  - [[#bindings][Bindings]]
- [[#general-configuration][General Configuration]]
  - [[#removing-some-default-ui-elements][Removing some default ui elements]]
  - [[#fonts][Fonts]]
  - [[#column-and-line-numbers][Column and Line Numbers]]
  - [[#visual-lines][Visual lines]]
  - [[#tabs-and-indentation][Tabs and indentation]]
  - [[#icons][Icons]]
  - [[#colorscheme-theme][Colorscheme (theme)]]
  - [[#modeline-statusline-in-vimish][Modeline (statusline in vimish)]]
  - [[#startup-screen][Startup Screen]]
  - [[#workspaces][Workspaces]]
  - [[#use-better-versions-of-unix-utilities][Use better versions of UNIX utilities]]
- [[#org-mode][Org Mode]]
  - [[#binding-prefix][Binding Prefix]]
  - [[#org-configuration][Org Configuration]]
  - [[#faces][Faces]]
  - [[#tags][Tags]]
  - [[#capture-templates][Capture Templates]]
  - [[#agenda][Agenda]]
  - [[#habit-tracking][Habit Tracking]]
  - [[#babel][Babel]]
  - [[#structure-templates][Structure Templates]]
  - [[#latex-workflow][LaTeX workflow]]
  - [[#end-use-package][End use-package]]
  - [[#update-toc-on-save][Update TOC on Save]]
  - [[#citations][Citations]]
  - [[#org-roam][Org Roam]]
  - [[#flashcards][Flashcards]]
  - [[#packages][Packages]]
    - [[#org-superstar][org-superstar]]
    - [[#grip-mode][grip-mode]]
    - [[#org-mime][org-mime]]
    - [[#org-appear][org-appear]]
  - [[#auto-tangle-configuration-files][Auto-tangle Configuration Files]]
- [[#development][Development]]
  - [[#binding-prefixes][Binding Prefixes]]
  - [[#projectile][Projectile]]
    - [[#counsel-projectile][counsel-projectile]]
  - [[#git][Git]]
    - [[#magit][Magit]]
    - [[#forge][Forge]]
  - [[#language-server-protocol][Language Server Protocol]]
    - [[#add-localbin-to-exec-path-for-lsp-servers][Add .local/bin to exec path for lsp servers]]
  - [[#debug-adapter-protocol][Debug Adapter Protocol]]
  - [[#snippets][Snippets]]
  - [[#languages][Languages]]
    - [[#meta-lisp][Meta Lisp]]
    - [[#emacs-lisp][Emacs Lisp]]
    - [[#scheme-lisp][Scheme Lisp]]
    - [[#common-lisp][Common Lisp]]
    - [[#nix][Nix]]
    - [[#haskell][Haskell]]
    - [[#typescript][TypeScript]]
    - [[#python][Python]]
    - [[#dart][Dart]]
    - [[#markdown][Markdown]]
      - [[#markdown-mode][markdown-mode]]
      - [[#markdown-toc][markdown-toc]]
    - [[#html][HTML]]
      - [[#tailwind-css][Tailwind CSS]]
    - [[#shell-scripting][Shell scripting]]
  - [[#productivity][Productivity]]
    - [[#syntax-checking-with-flycheck][Syntax checking with Flycheck]]
    - [[#raibow-delimiters][Raibow Delimiters]]
    - [[#rainbow-mode][Rainbow Mode]]
    - [[#highlight-todos][Highlight TODOs]]
  - [[#tree-sitter][Tree-Sitter]]
  - [[#direnv][Direnv]]
- [[#applications][Applications]]
  - [[#binding-prefix][Binding Prefix]]
  - [[#vterm][Vterm]]
  - [[#eshell][Eshell]]
    - [[#aliases][Aliases]]
  - [[#file-browsing][File Browsing]]
    - [[#dired][Dired]]
      - [[#key-bindingschords-cheatsheet][Key Bindings/Chords Cheatsheet]]
        - [[#navigation][Navigation]]
        - [[#marking-files][Marking Files]]
        - [[#copyingrenaming][Copying/Renaming]]
        - [[#deleting][Deleting]]
        - [[#creating-and-extracting][Creating and Extracting]]
        - [[#other-common-operations][Other common operations]]
      - [[#configuration][Configuration]]
    - [[#opening-files-externally][Opening Files Externally]]
  - [[#chat][Chat]]
    - [[#telegram][Telegram]]
    - [[#erc][ERC]]
    - [[#discord][Discord]]
  - [[#elpher][Elpher]]
  - [[#languagetool][LanguageTool]]
  - [[#mail-management][Mail management]]
  - [[#pomodoro-timer][Pomodoro timer]]
  - [[#reference-browsing][Reference browsing]]
- [[#credential-management][Credential Management]]
- [[#utility-functions][Utility Functions]]
- [[#runtime-performance][Runtime Performance]]
- [[#emacs-profile][Emacs Profile]]
- [[#local-variables][Local Variables]]
:END:

* About This Config
This is my GNU Emacs config. I had been using [[https://github.com/hlissner/doom-emacs][Doom Emacs]] for a little while and really liked the experience of using Emacs. However, I wanted to try configuring Emacs myself, so that I could tune it to my personal workflow. So I stopped using Doom Emacs and came to good old GNU Emacs. This is my configuration.

* Setting Up a Literate Config
Having this in your =init.el= permits using =config.org= to configure Emacs.

#+begin_example
(org-babel-load-file
  (expand-file-name
    "config.org"
    user-emacs-directory))
#+end_example

One important thing to remember is that for this to work, your elisp snippets need to be marked as =emacs-lisp=. Although =elisp= works as well for everything else, specifically for =org-babel-load-file= is doesn't. Not really sure why :/.

Other possibility is having this in the top of your org config file (I'm using this):

#+begin_example
#+PROPERTY: header-args:emacs-lisp :tangle ~/.emacs.d/init.el :mkdirp yes
#+end_example

* Startup Performance

Some operations for startup performance. This is tangled to =early-init.el= to be executed earlier in the startup process. Heavily inspired by [[https://github.com/hlissner/doom-emacs/blob/develop/early-init.el][Doom's early-init.el]].

#+begin_src emacs-lisp :tangle .emacs.d/early-init.el
  ;; -*- lexical-binding: t; -*-
  ;; The default is 800 kilobytes.  Measured in bytes.
  (setq gc-cons-threshold most-positive-fixnum)

  (defun lhgh/display-startup-time ()
    (message "Emacs loaded in %s with %d garbage collections."
             (format "%.2f seconds"
                     (float-time
                      (time-subtract after-init-time before-init-time)))
             gcs-done))

  (add-hook 'emacs-startup-hook #'lhgh/display-startup-time)

  ;; Premature redisplays can substantially affect startup times and produce
  ;; ugly flashes of unstyled Emacs.
  (setq-default inhibit-redisplay t
                inhibit-message t)
  (add-hook 'window-setup-hook
            (lambda ()
              (setq-default inhibit-redisplay nil
                            inhibit-message nil)
              (redisplay)))

  ;; Site files tend to use `load-file', which emits "Loading X..." messages in
  ;; the echo area, which in turn triggers a redisplay. Redisplays can have a
  ;; substantial effect on startup times and in this case happens so early that
  ;; Emacs may flash white while starting up.
  (define-advice load-file (:override (file) silence)
    (load file nil 'nomessage))

  ;; Undo our `load-file' advice above, to limit the scope of any edge cases it
  ;; may introduce down the road.
  (define-advice startup--load-user-init-file (:before (&rest _) remove-load-file-silence)
    (advice-remove #'load-file #'load-file@silence))
#+end_src

* Global Mappings
Some global keyboard mappings

** ESC cancels commands
=ESC= behaves like =C-g=.

#+begin_src emacs-lisp
  (global-set-key (kbd "<escape>") 'keyboard-escape-quit)
#+end_src

* Package Management

** General package setup (package.el)
Initializing package sources. (Not using this right now, trying straight.el)

#+begin_src emacs-lisp :tangle no
  (require 'package)
  (setq package-archives '(("melpa"        . "https://melpa.org/packages/")
                           ("melpa-stable" .  "https://stable.melpa.org/packages/")
                           ("org"          . "https://orgmode.org/elpa/")
                           ("elpa"         . "https://elpa.gnu.org/packages/")))
#+end_src

Initializing package system

#+begin_src emacs-lisp :tangle no
  (package-initialize)
  (unless package-archive-contents
    (package-refresh-contents))
#+end_src

** straight.el
[[https://github.com/raxod502/straight.el][straight.el]] is an alternative to =package.el=, which permits installing directly from git repos and other useful features.

#+begin_src emacs-lisp
;; Bootstrap straight.el
(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))


;; Load the helper package for commands like `straight-x-clean-unused-repos'
(require 'straight-x)
#+end_src

** guix
I started using [[https://guix.gnu.org/][GNU Guix]] recently along with my Gentoo system and managing the Emacs packages with the =guix= package manager there. This variable helps defining use-package to use straight by default only on non-Guix OSs.

#+begin_src emacs-lisp
  (straight-use-package 'f)
  (setq lhgh/is-guix-system (and (require 'f)
                                 (string-equal (f-read "/etc/issue")
                                               "\nThis is the GNU system.  Welcome.\n")))
#+end_src

*Guix Packages*

#+begin_src scheme

  "emacs-guix"
  "emacs-f"
  "make"
  "cmake"

#+end_src

** =use-package= setup
I personally use [[https://github.com/jwiegley/use-package][use-package]] because I like how it helps fragmenting my configuration in sensible way.

*** =package.el= setup

#+begin_src emacs-lisp :tangle no
  (require 'use-package)
  (setq use-package-always-ensure (not lhgh/is-guix-system)) ;; Install a package if it isn't installed already on non-Guix systems
  ;; (setq use-package-verbose t) ;; Uncomment to bench mark use-package
#+end_src

*** =straight.el= setup

#+begin_src emacs-lisp
  (straight-use-package 'use-package) ;; Use straight.el for use-package expressions
  (setq straight-use-package-by-default (not lhgh/is-guix-system)) ;; Install a package if it isn't installed already on non-Guix systems
  ;; (setq use-package-verbose t) ;; Uncomment to bench mark use-package
#+end_src

* Keep .emacs.d Clean

#+begin_src emacs-lisp
  ;; Change the user-emacs-directory to keep unwanted things out of ~/.emacs.d
  (setq user-emacs-directory (expand-file-name "~/.cache/emacs/")
        url-history-file (expand-file-name "url/history" user-emacs-directory))

  ;; Use no-littering to automatically set common paths to the new user-emacs-directory
  (use-package no-littering)

  ;; Keep customization settings in a temporary file
  (setq custom-file
        (if (boundp 'server-socket-dir)
            (expand-file-name "custom.el" server-socket-dir)
          (expand-file-name (format "emacs-custom-%s.el" (user-uid)) temporary-file-directory)))
  (load custom-file t)
#+end_src

*Guix Packages*

#+begin_src scheme

  "emacs-no-littering"

#+end_src

* Update Load Path
I have other org files, like [[file:Desktop.org][Desktop.org]], that provide .el files to be loaded at the =.emacs.d/lisp= folder.

#+begin_src emacs-lisp
  (push "~/.emacs.d/lisp" load-path)
#+end_src

* Desktop Environment
Load up the desktop environment if the =--use-exwm= argument was passed to Emacs on startup. Desktop environment and window management code can be found in [[file:Desktop.org][Desktop.org]].

#+begin_src emacs-lisp
  (setq lhgh/exwm-enabled (and (eq window-system 'x)
                            (seq-contains command-line-args "--use-exwm")))

  (when lhgh/exwm-enabled
    (require 'lhgh-desktop))
#+end_src

*Guix Packages*

Despite the code being in Desktop.org, include the emacs packages for the desktop environment in this file so that they can be included in the Emacs profile.

#+begin_src scheme

  "emacs-exwm"
  "emacs-desktop-environment"
  ;; "emacs-app-launcher"

#+end_src

* Key Bindings

