Emacs.org
** Dark Side (Evil)
This is the main section of configuration that makes Emacs usable for me. Before I discovered [[https://github.com/emacs-evil/evil][Evil]], I thought using Emacs was unbearable due to its odd default key bindings/chords and the lack of modal editing. Now, I use the incredible features of Emacs while editing the files in it the same way I do in (Neo)vim.

*** Evil
[[https://github.com/emacs-evil/evil][Evil]] is an extensible vi(m) layer for Emacs. It emulates its main features and provides facilites for writing extensions.

#+begin_src emacs-lisp
  (use-package undo-tree
    :init
    (global-undo-tree-mode 1))

  (use-package evil
    :init ;; tweak evil's configuration before loading it (as suggested in the package's documentation)
    (setq evil-want-integration t)
    (setq evil-want-keybinding nil) ;; required by evil-collection
    (setq evil-want-C-u-scroll t) ;; an optional part of `evil-want-integration', I personally like it
    (setq evil-want-Y-yank-to-eol t) ;; Y => y$ (like in Neovim)
    (setq evil-respect-visual-line-mode t) ;; move by visual lines
    (setq evil-vsplit-window-right t)
    (setq evil-split-window-below t)
    :config
    (evil-mode 1)
    (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)) ;; C-g is trully equal to ESC
#+end_src

*Guix Packages*

#+begin_src scheme

  "emacs-evil"
  "emacs-undo-tree"

#+end_src

*** Enhancing evil

**** evil-collection
[[https://github.com/emacs-evil/evil-collection][Evil Collection]] is a collection of Evil bindings for the parts of Emacs that Evil does not cover properly by default, such as =help-mode=, =M-x calendar=, Eshell and more.

#+begin_src emacs-lisp
  (use-package evil-collection
    :after evil
    :init
    (setq evil-collection-company-use-tng nil)
    :config
    (evil-collection-init))
#+end_src

**** evil-nerd-commenter
[[https://github.com/redguardtoo/evil-nerd-commenter][evil-nerd-commenter]] is like [[http://www.vim.org/scripts/script.php?script_id=1218][Nerd Commenter]] in Vim.

#+begin_src emacs-lisp
  (use-package evil-nerd-commenter
    :after evil
    :config (evilnc-default-hotkeys t) ;; use default key bindings (M-;) in Emacs state
    :bind (:map evil-normal-state-map
           ("gc" . evilnc-comment-or-uncomment-lines)))
#+end_src

*Guix Packages*

#+begin_src scheme

  "emacs-evil-collection"
  "emacs-evil-nerd-commenter"

#+end_src

** general.el
[[https://github.com/fbergroth/general.el][general.el]] provides a convenient, unified interface for key definitions. It can be viewed as a =use-package= for key bindings.

#+begin_src emacs-lisp
  (use-package general
    :after evil
    :config
    (general-create-definer lhgh/leader-maps
      :states '(normal insert emacs)
      :prefix "SPC" ;; The prefix in normal state
      :global-prefix "C-SPC") ;; The prefix accessible in any state

    (general-create-definer lhgh/ctrl-c-binds
      :states '(normal insert emacs)
      :prefix "C-c")

    (lhgh/leader-maps
      "t"  '(:ignore t :which-key "toggles")
      "tt" '(consult-theme :which-key "choose theme")
      "tv" '(visual-line-mode :which-hey "visual lines")))
#+end_src

*Guix Packages*

#+begin_src scheme

  "emacs-general"

#+end_src

** Hydra
[[https://github.com/abo-abo/hydra][Hydra]] is a package that can be used to tie related commands into a single prefix and execute them in succesion after calling such prefix.

#+begin_src emacs-lisp
  (use-package hydra
    :defer 1) ;; load only when a defhydra is called
#+end_src

*Guix Packages*

#+begin_src scheme

  "emacs-hydra"

#+end_src

** which-key
[[https://github.com/justbur/emacs-which-key][which-key]] displays the key bindings following your currently incomplete command (a prefix) in a popup.

#+begin_src emacs-lisp
(use-package which-key
  :init (which-key-mode)
  :diminish which-key-mode
  :config
  (setq which-key-idle-delay 0.3))
#+end_src

*Guix Packages*

#+begin_src scheme

  "emacs-which-key"

#+end_src

* Completion

** Old Setup (Ivy)
Not using these right now. Trying =vertico=.

*** Ivy
I use [[http://oremacs.com/swiper/][ivy]] for generic completion in Emacs, basically because I got accustomed to it in [[https://github.com/hlissner/doom-emacs][Doom Emacs]] (which has it enabled by default).

#+begin_src emacs-lisp :tangle no
  (use-package ivy
    :diminish
    :bind (("C-s" . swiper)) ;; replaces I-search with swiper
    :config
    (ivy-mode 1))
  (use-package ivy-rich ;; richer ivy and counsel commands (descriptions, key bindings, etc)
    :init (ivy-rich-mode 1))
#+end_src

*** Counsel
[[https://github.com/abo-abo/swiper#counsel][Counsel]] is a collection of Ivy-enhanced versions of common Emacs commands, like =counsel-find-file=.

#+begin_src emacs-lisp :tangle no
  (use-package counsel
    :init (counsel-mode 1)
    :config
    (setq ivy-initial-inputs-alist nil)) ;; Don't start searches with ^
#+end_src

*** Navigation bindings

#+begin_src emacs-lisp :tangle no
  (lhgh/leader-maps
    "."  '(counsel-find-file :which-key "find file")
    "b" '(:ignore t :which-key "buffers")
    "bb" '(ivy-switch-buffer :which-key "switch buffer"))
#+end_src

*** Helpful
[[https://github.com/Wilfred/helpful][Helpful]] enhances Help buffers (this is here because you generally get to help pages from counsel commands, so yeah).

#+begin_src emacs-lisp :tangle no
  (use-package helpful
    :custom
    (counsel-describe-function-function #'helpful-callable)
    (counsel-describe-variable-function #'helpful-variable)
    :bind
    ([remap describe-function] . counsel-describe-function)
    ([remap describe-command] . helpful-command)
    ([remap describe-variable] . counsel-describe-variable)
    ([remap describe-key] . helpful-key))
#+end_src

** Vertico
A more minimal alternative to =Ivy=.  It uses the default completion system, which means it achieves full compatibility with built-in Emacs commands and completion tables.

#+begin_src emacs-lisp
  (defun lhgh/minibuffer-backward-kill (arg)
    "When minibuffer is completing a file name delete up to parent folder, otherwise delete a word"
    (interactive "p")
    (if minibuffer-completing-file-name
      ;; Borrowed from https://github.com/raxod502/selectrum/issues/498#issuecomment-803283608
      (if (string-match-p "/." (minibuffer-contents))
          (zap-up-to-char (- arg) ?/)
        (delete-minibuffer-contents))
      (backward-delete-char arg)))

  (use-package vertico
    :bind (:map vertico-map
           ("C-j" . vertico-next)
           ("C-k" . vertico-previous)
           ("C-l" . vertico-exit-input)
           :map minibuffer-local-map
           ("M-h" . backward-kill-word)
           ("<backspace>" . lhgh/minibuffer-backward-kill))
    :custom-face
    (vertico-current ((t (:background "#3a3f5a"))))
    :init
    (vertico-mode))
#+end_src

*Guix Packages*

#+begin_src scheme

  "emacs-vertico"

#+end_src

** Consult
Consult provides a lot of useful completion commands similar to Ivy’s Counsel. It is compatible with any completion system based on the standard Emacs completing-read API, like =Vertico= or =Selectrum.=

#+begin_src emacs-lisp
  (defun lhgh/get-project-root ()
    (when (fboundp 'projectile-project-root)
      (projectile-project-root)))

  (use-package consult
    :bind (("C-s" . consult-line))
    :custom
    (consult-project-root-function #'lhgh/get-project-root)
    (completion-in-region-function #'consult-completion-in-region))
#+end_src

*Guix Packages*

#+begin_src scheme

  "emacs-consult"

#+end_src

** Marginalia
Marginalia provides helpful annotations for various types of minibuffer completions. You can think of it as a replacement of =ivy-rich=.

#+begin_src emacs-lisp
  (use-package marginalia
    :after vertico
    :init
    (marginalia-mode))
#+end_src

*Guix Packages*

#+begin_src scheme

  "emacs-marginalia"

#+end_src

** Corfu
Corfu can be considered the minimalistic =completion-at-point= counterpart of =Vertico=. Similar to it. Because it uses the same plugggable backend format that the built in =completion-at-point= uses, it has full compatibility with a lot of Emacs packages, like =lsp-mode=.

#+begin_src emacs-lisp
  (use-package corfu
    :demand t
    :bind (:map corfu-map
           ("M-j" . corfu-next)
           ("M-k" . corfu-previous)
           ("M-g" . corfu-quit))
    :custom
    (corfu-cycle t)
    :config
    (setq tab-always-indent 'complete)
    (corfu-global-mode 1))
#+end_src

*Guix Packages*

#+begin_src scheme

  "emacs-corfu"

#+end_src

** Orderless

#+begin_src emacs-lisp
  (use-package orderless
    :straight t
    :init
    (setq completion-styles '(orderless)
          completion-category-defaults nil
          completion-category-overrides '((file (styles . (partial-completion))))))
#+end_src

** Embark
Context action for completion minibuffers.

#+begin_src emacs-lisp
  (use-package embark
    :straight t
    :bind (("C-S-a" . embark-act)
           :map minibuffer-local-map
           ("C-d" . embark-act))
    :config
    ;; Use Embark to show command prefix help
    (setq prefix-help-command #'embark-prefix-help-command)

    ;; Show Embark actions via which-key
    (setq embark-action-indicator
          (lambda (map _target)
            (which-key--show-keymap "Embark" map nil nil 'no-paging)
            #'which-key--hide-popup-ignore-command)
          embark-become-indicator embark-action-indicator))

  (use-package embark-consult
    :straight t
    :after (embark consult)
    :demand t ; only necessary if you have the hook below
    ;; if you want to have consult previews as you move around an
    ;; auto-updating embark collect buffer
    :hook
    (embark-collect-mode . consult-preview-at-point-mode))
#+end_src

** Helpful
[[https://github.com/Wilfred/helpful][Helpful]] enhances Help buffers.

#+begin_src emacs-lisp
  (use-package helpful
    :bind
    ([remap describe-function] . helpful-callable)
    ([remap describe-variable] . helpful-variable)
    ([remap describe-key] . helpful-key))
#+end_src

*Guix Packages*

#+begin_src scheme

  "emacs-helpful"

#+end_src

** Bindings

#+begin_src emacs-lisp
  (lhgh/leader-maps
    "."  '(find-file :which-key "find file")
    "b" '(:ignore t :which-key "buffers")
    "bb" '(consult-buffer :which-key "switch buffer"))
#+end_src

* General Configuration

** Removing some default ui elements
Do I really need to explain the following options? Just look at that default toolbar, *eww*.

#+begin_src emacs-lisp :tangle .emacs.d/early-init.el
  (setq inhibit-startup-message t)

  (scroll-bar-mode -1)
  (tool-bar-mode -1)
  (tooltip-mode -1)
  (set-fringe-mode 10)

  (menu-bar-mode -1)

  (setq ring-bell-function 'ignore)
#+end_src

** Fonts

#+begin_src emacs-lisp
  (defun lhgh/set-font-faces ()
    (set-face-attribute 'default nil
      :font "JetBrains Mono 11"
      :weight 'medium)
    (set-face-attribute 'fixed-pitch nil
      :font "JetBrains Mono 11"
      :weight 'medium)
    (set-face-attribute 'variable-pitch nil
      :font "Iosevka Aile 15"
      :weight 'medium))

  (if (daemonp)
    (add-hook 'after-make-frame-functions
              (lambda (frame)
               (with-selected-frame frame
                (lhgh/set-font-faces))))
    (lhgh/set-font-faces))
#+end_src

