.emacs.d/init.el

(use-package undo-tree
  :init
  (global-undo-tree-mode 1))

(use-package evil
  :init ;; tweak evil's configuration before loading it (as suggested in the package's documentation)
  (setq evil-want-integration t)
  (setq evil-want-keybinding nil) ;; required by evil-collection
  (setq evil-want-C-u-scroll t) ;; an optional part of `evil-want-integration', I personally like it
  (setq evil-vsplit-window-right t)
  (setq evil-split-window-below t)
  :config
  (evil-mode 1)
  (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state) ;; C-g is trully equal to ESC

  ;; j and k move through visual lines
  (evil-global-set-key 'motion "j" 'evil-next-visual-line)
  (evil-global-set-key 'motion "k" 'evil-previous-visual-line))

(use-package evil-collection
  :after evil
  :config
  (evil-collection-init))

(use-package evil-nerd-commenter
  :after evil
  :config (evilnc-default-hotkeys t) ;; use default key bindings (M-;) in Emacs state
  :bind (:map evil-normal-state-map
         ("gc" . evilnc-comment-or-uncomment-lines)))

(use-package general
  :after evil
  :config
  (general-create-definer lhgh/leader-maps
    :states '(normal insert emacs)
    :prefix "SPC" ;; The prefix in normal state
    :global-prefix "C-SPC") ;; The prefix accessible in any state

  (lhgh/leader-maps
    "t"  '(:ignore t :which-key "toggles")
    "tt" '(consult-theme :which-key "choose theme")
    "tv" '(visual-line-mode :which-hey "visual lines")))

(use-package hydra
  :defer 1) ;; load only when a defhydra is called

(use-package which-key
  :init (which-key-mode)
  :diminish which-key-mode
  :config
  (setq which-key-idle-delay 0.3))

(defun lhgh/minibuffer-backward-kill (arg)
  "When minibuffer is completing a file name delete up to parent folder, otherwise delete a word"
  (interactive "p")
  (if minibuffer-completing-file-name
    ;; Borrowed from https://github.com/raxod502/selectrum/issues/498#issuecomment-803283608
    (if (string-match-p "/." (minibuffer-contents))
        (zap-up-to-char (- arg) ?/)
      (delete-minibuffer-contents))
    (backward-delete-char arg)))

(use-package vertico
  :bind (:map vertico-map
         ("C-j" . vertico-next)
         ("C-k" . vertico-previous)
         ("C-l" . vertico-exit-input)
         :map minibuffer-local-map
         ("M-h" . backward-kill-word)
         ("<backspace>" . lhgh/minibuffer-backward-kill))
  :custom-face
  (vertico-current ((t (:background "#3a3f5a"))))
  :init 
  (vertico-mode))

(defun lhgh/get-project-root ()
  (when (fboundp 'projectile-project-root)
    (projectile-project-root)))

(use-package consult
  :bind (("C-s" . consult-line))
  :custom
  (consult-project-root-function #'lhgh/get-project-root)
  (completion-in-region-function #'consult-completion-in-region))

(use-package marginalia
  :after vertico
  :init
  (marginalia-mode))

(use-package corfu
  ;; :straight (if lhgh/is-guix-system
  ;;               nil
  ;;             '(corfu :host github
  ;;                     :repo "minad/corfu"))
  :straight nil
  :demand t
  :bind (:map corfu-map
	 ("M-j" . corfu-next)
	 ("M-k" . corfu-previous))
  :custom
  (corfu-cycle t)
  :config
  (setq tab-always-indent 'complete)
  (corfu-global-mode 1))

(use-package orderless
  :straight t
  :init
  (setq completion-styles '(orderless)
        completion-category-defaults nil
        completion-category-overrides '((file (styles . (partial-completion))))))

(use-package embark
  :straight t
  :bind (("C-S-a" . embark-act)
         :map minibuffer-local-map
         ("C-d" . embark-act))
  :config

  ;; Show Embark actions via which-key
  (setq embark-action-indicator
        (lambda (map _target)
          (which-key--show-keymap "Embark" map nil nil 'no-paging)
          #'which-key--hide-popup-ignore-command)
        embark-become-indicator embark-action-indicator))

(use-package helpful
  :bind
  ([remap describe-function] . helpful-callable)
  ([remap describe-variable] . helpful-variable)
  ([remap describe-key] . helpful-key))

(lhgh/leader-maps
  "."  '(find-file :which-key "find file")
  "b" '(:ignore t :which-key "buffers")
  "bb" '(consult-buffer :which-key "switch buffer"))

(setq inhibit-startup-message t)

(scroll-bar-mode -1)
(tool-bar-mode -1)
(tooltip-mode -1)
(set-fringe-mode 10)

(menu-bar-mode -1)

(setq ring-bell-function 'ignore)

(set-face-attribute 'default nil
  :font "JetBrains Mono 11"
  :weight 'medium)
(set-face-attribute 'variable-pitch nil
  :font "Iosevka Aile 15"
  :weight 'medium)
