Emacs.org
** Column and Line Numbers
Enabling column in mode-line and line numbers for some modes.

#+begin_src emacs-lisp
  (column-number-mode) ;; Shows column number in mode-line
  ;; (global-display-line-numbers-mode t) ;; Shows line numbers globally
  (setq display-line-numbers-type 'relative) ;; Relative line numbers

  ;; Enable line numbers for some modes
  (dolist (mode '(text-mode-hook
                  prog-mode-hook
                  conf-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 1))))

  ;; Override some modes which derive from the above
  (dolist (mode '(org-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 0))))
#+end_src

** Visual lines
Word wrapping is disabled by default. I like it to be on in certain modes, like Org. In others, I generally don't like it. If I need it at some moment, I can toggle it with =SPC-t-v=.

#+begin_src emacs-lisp
  (dolist (mode '(org-mode-hook
                  markdown-mode-hook))
    (add-hook mode (lambda () (visual-line-mode t))))
#+end_src

** Tabs and indentation
Enabling TAB key for completion and disabling its indentation functionality. I have tried using =indent-tabs-mode= for a while, but it was way too confusing for me. I prefer for =TAB= to *always* complete and to do indentation with evil's === comands.

#+begin_src emacs-lisp
  (setq-default tab-always-indent 'complete)
  (setq-default tab-width 4)
  (setq-default indent-tabs-mode nil)
#+end_src

** Icons
[[https://github.com/domtronn/all-the-icons.el][all-the-icons]] is a utility package to collect various Icon Fonts and propertize them within Emacs.

#+begin_src emacs-lisp
    (use-package all-the-icons
      :if (display-graphic-p)
      :commands all-the-icons-install-fonts
      :init
      (unless (or lhgh/is-guix-system
                  (find-font (font-spec :name "all-the-icons")))
        (all-the-icons-install-fonts t)))
#+end_src

*Guix Packages*

#+begin_src scheme

  "emacs-all-the-icons"

#+end_src

** Colorscheme (theme)
I use [[https://github.com/hlissner/emacs-doom-themes#doom-emacs][doom-themes]] colorschemes.

#+begin_src emacs-lisp
  (use-package doom-themes
    :config
    ;; Global settings (defaults)
    (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
          doom-themes-enable-italic t) ; if nil, italics is universally disabled
    (load-theme 'doom-palenight t) ; sets the proper theme

    ;; Enable flashing mode-line on errors
    (doom-themes-visual-bell-config)

    ;; Enable custom neotree theme (all-the-icons must be installed!)
    ;;(doom-themes-neotree-config)

    ;; Corrects (and improves) org-mode's native fontification.
    (doom-themes-org-config))
#+end_src

*Guix Packages*

#+begin_src scheme

  "emacs-doom-themes"

#+end_src

** Modeline (statusline in vimish)
I use [[https://github.com/seagle0128/doom-modeline][doom-modeline]] because it is minimal and has many useful features. Also because it just looks good ¯\_(ツ)_/¯.

#+begin_src emacs-lisp
  (use-package doom-modeline
    :init (doom-modeline-mode 1)
    :custom
    (doom-modeline-buffer-file-name-style 'truncate-with-project)
    (doom-modeline-buffer-encoding nil))
#+end_src

*Guix Packages*

#+begin_src scheme

  "emacs-doom-modeline"

#+end_src

** Startup Screen
I use [[https://github.com/emacs-dashboard/emacs-dashboard][Emacs Dashboard]] as my startup screen.

#+begin_src emacs-lisp
  (use-package dashboard
    :disabled t ; depends on page-break-lines, which is currently breaking Org-roam
    :defer lhgh/exwm-enabled ;; defer if in EXWM because it doesn't make sense in that context
    :init
    (setq dashboard-set-heading-icons t)
    (setq dashboard-set-file-icons t)
    (setq dashboard-banner-logo-title "May I save your soul?")
    (setq dashboard-startup-banner 'logo)
    (setq dashboard-items '((recents . 10)
                            (agenda . 5)
                            (projects . 5)))
    (unless lhgh/exwm-enabled
      (dashboard-setup-startup-hook)))
#+end_src

*Guix Packages*

#+begin_src scheme

 ; "emacs-dashboard"

#+end_src

** Workspaces

#+begin_src emacs-lisp
  (use-package perspective
    :demand t
    :bind (("C-M-k" . persp-switch)
           ("C-M-n" . persp-next)
           ("C-x k" . persp-kill-buffer*))
    :custom
    (persp-initial-frame-name "Main")
    :config
    ;; Running `persp-mode' multiple times resets the perspective list...
    (unless (equal persp-mode t)
      (persp-mode)))
#+end_src

*Guix Packages*

#+begin_src scheme

  "emacs-perspective"

#+end_src

** Use better versions of UNIX utilities

*** COMMENT Grep

#+begin_src emacs-lisp
  ;; TODO try to fix this https://www.reddit.com/r/emacs/comments/gyusav/comment/ftdl00c/?utm_source=share&utm_medium=web2x&context=3
  (grep-apply-setting
   'grep-find-command
   '("find . -type f -exec rg --no-heading --color always -0 -H -e '' \\{\\} +" . 63))

  (grep-apply-setting
   'grep-template "rg --no-heading -H -uu -g <F> <R> <D>")
#+end_src

* Org Mode
[[https://orgmode.org/][Org Mode]] is for keeping notes, maintaining to-do lists, planning projects, authoring documents, computational notebooks, literate programming and more — in a fast and effective plain text system.

** Binding Prefix

#+begin_src emacs-lisp
  (lhgh/leader-maps
    "o" '(:ignore t :which-key "org"))
#+end_src

** Org Configuration

#+begin_src emacs-lisp
  (defun lhgh/org-mode-setup ()
    (org-indent-mode)
    (variable-pitch-mode)
    (setq evil-auto-indent nil))

  (when lhgh/is-guix-system
    ;; Use org provided by Guix
    (straight-use-package '(org :type built-in)))

  (use-package org
    :hook (org-mode . lhgh/org-mode-setup)
    :commands (org-capture org-agenda) ;; Org is deferred, these commands are autoloaded so they can be used before opening an Org file
    :general
    (org-mode-map
     :states 'normal
     "<tab>" 'org-cycle)
    (lhgh/leader-maps org-mode-map
      "mh" '(consult-org-heading :which-key "find-header")
      "mtc" '(org-toggle-checkbox :which-key "checkbox"))
    :config
    (setq org-ellipsis " ▾"
          org-hide-emphasis-markers t)

  ;; NOTE: Subsequent sections are still part of this use-package block!
#+end_src

*Guix Packages*

#+begin_src scheme

  "emacs-org"

#+end_src

** Faces
I try to make Org Mode buffers seem more like notebooks, using mostly a variable pitch font. However, I still use a fixed pitch font in places like code for practicality.

#+begin_src emacs-lisp
  ;; Increase the size of various headings
  (with-eval-after-load 'org-indent
    (set-face-attribute 'org-document-title nil :weight 'bold :height 1.3 :inherit 'variable-pitch)

    (dolist (face '((org-level-1 . 1.2)
                    (org-level-2 . 1.1)
                    (org-level-3 . 1.05)
                    (org-level-4 . 1.0)
                    (org-level-5 . 1.1)
                    (org-level-6 . 1.1)
                    (org-level-7 . 1.1)
                    (org-level-8 . 1.1)))
      (set-face-attribute (car face) nil :font "Iosevka Aile" :weight 'medium :height (cdr face)))

    ;; Ensure that anything that should be fixed-pitch in Org files appears that way
    (set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
    (set-face-attribute 'org-table nil  :inherit 'fixed-pitch)
    (set-face-attribute 'org-formula nil  :inherit 'fixed-pitch)
    (set-face-attribute 'org-code nil   :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-indent nil :inherit '(org-hide fixed-pitch))
    (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch))
#+end_src

** TODO Tags

#+begin_src emacs-lisp
  (setq org-tag-alist
    '((:startgroup) ;; mutually exclusive tags go here

      ;; CEFET tags
      (:startgroup)
      ("@CEFET"     . ?C)
      (:grouptags)
      (:startgroup)
      ("Ensino Médio" . ?E)
      (:grouptags)
      ("Português" . ?p)
      ("Matemática" . ?m)
      ("Física"     . ?f)
      ("História"   . ?h)
      ("Inglês"     . ?i)
      ("Química"    . ?q)
      ("Redação"    . ?r)
      ("Sociologia" . ?s)
      (:endgroup)
      (:startgroup)
      ("Técnico" . ?T)
      (:grouptags)
      ("PDM"        . ?d)
      ("TCC"        . ?t)
      ("PS"         . ?a)
      ("RC"         . ?c)
      ("SO"         . ?o)
      ("TEI"        . ?e)
      (:endgroup)

      ;; Other major tags
      ("@mandarim" . ?M)
      ("@redacao"  . ?R)
      ("@pessoal"  . ?P)
      (:endgroup)))
#+end_src

** Capture Templates

#+begin_src emacs-lisp
  (setq org-capture-templates
    '(("t" "Tasks")
      ("tt" "Task" entry (file+olp "~/Documents/Org/Agenda/Tasks.org" "Inbox")
        "* TODO %?\n%U\n%a\n%i" :empty-lines 1)
      ("m" "Email")
      ("mr" "Read Later" entry (file+olp "~/Documents/Org/Agenda/Tasks.org" "Email")
        "* TODO Read %:subject from %:from\n%a\n%U\n\n%i" :empty-lines 1 :immediate-finish t)))
  (lhgh/leader-maps
    "oc" '(org-capture :which-key "capture"))
#+end_src

** Agenda

#+begin_src emacs-lisp
    (setq org-agenda-files
      '("~/Documents/Org/Agenda/Tasks.org"
        "~/Documents/Org/Agenda/Habits.org"))
    (setq org-log-done 'time)

    (lhgh/leader-maps
      "oa" '(org-agenda :which-key "agenda"))

    ;; Custom agenda views
    (setq org-agenda-custom-commands
      '(("d" "Dashboard"
         ((agenda "" ((org-deadline-warning-days 7)))
          (tags-todo "+@CEFET"
            ((org-agenda-overriding-header "Next CEFET Tasks")
             (org-agenda-max-todos 5)))
          (tags-todo "+@mandarim|@redacao|@pessoal"
            ((org-agenda-overriding-header "Next Other Tasks")))))))
#+end_src

** Habit Tracking

#+begin_src emacs-lisp
  (require 'org-habit)
  (add-to-list 'org-modules 'org-habit)
  (setq org-habit-graph-column 60)
#+end_src

** Babel
This block tells which languages org-babel should load. Check [[https://orgmode.org/worg/org-contrib/babel/languages/index.html][here]] for supported languages.

#+begin_src emacs-lisp
  (with-eval-after-load 'org
    (org-babel-do-load-languages
     'org-babel-load-languages
     '((emacs-lisp . t)
       (python . t)
       (scheme . t)
       (latex . t))))
#+end_src

