.emacs.d/init.el

(column-number-mode) ;; Shows column number in mode-line
(global-display-line-numbers-mode t) ;; Shows line numbers
(setq display-line-numbers-type 'relative) ;; Relative line numbers

(dolist (mode '(term-mode-hook
                vterm-mode-hook
                dired-mode-hook
                calendar-mode-hook
                shell-mode-hook
                eshell-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 0))))

(dolist (mode '(org-mode-hook
                markdown-mode-hook))
  (add-hook mode (lambda () (visual-line-mode t))))

(use-package all-the-icons
  :if (display-graphic-p)
  :commands all-the-icons-install-fonts
  :init
  (unless (or lhgh/is-guix-system
              (find-font (font-spec :name "all-the-icons")))
    (all-the-icons-install-fonts t)))

(use-package doom-themes
  :config
  ;; Global settings (defaults)
  (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
        doom-themes-enable-italic t) ; if nil, italics is universally disabled
  (load-theme 'doom-palenight t) ; sets the proper theme

  ;; Enable flashing mode-line on errors
  (doom-themes-visual-bell-config)

  ;; Enable custom neotree theme (all-the-icons must be installed!)
  ;;(doom-themes-neotree-config)

  ;; Corrects (and improves) org-mode's native fontification.
  (doom-themes-org-config))

(use-package doom-modeline
  :init (doom-modeline-mode 1)
  :config
  ;; Whethe to display the buffer encoding.
  (setq doom-modeline-buffer-encoding nil))

(use-package dashboard
  :defer lhgh/exwm-enabled ;; defer if in EXWM because it doesn't make sense in that context
  :init
  (setq dashboard-set-heading-icons t)
  (setq dashboard-set-file-icons t)
  (setq dashboard-banner-logo-title "May I save your soul?")
  (setq dashboard-startup-banner 'logo)
  (setq dashboard-items '((recents . 10)
                          (agenda . 5)
                          (projects . 5)))
  (unless lhgh/exwm-enabled
    (dashboard-setup-startup-hook)))

(lhgh/leader-maps
  "o" '(:ignore t :which-key "org"))

(defun lhgh/org-mode-setup ()
  (org-indent-mode)
  (setq evil-auto-indent nil))

(use-package org
  :hook (org-mode . lhgh/org-mode-setup)
  :commands (org-capture org-agenda) ;; Org is deferred, these commands are autoloaded so they can be used before opening an Org file
  :general
  (lhgh/leader-maps org-mode-map
    "mh" '(consult-org-heading :which-key "find-header")
    "mtc" '(org-toggle-checkbox :which-key "checkbox"))
  :config
  (setq org-ellipsis " ▾"
        org-hide-emphasis-markers t)

;; NOTE: Subsequent sections are still part of this use-package block!

(setq org-tag-alist
  '((:startgroup) ;; mutually exclusive tags go here

    ;; CEFET tags
    (:startgroup)
    ("@CEFET"     . ?C)
    (:grouptags)
    (:startgroup)
    ("Ensino Médio" . ?E)
    (:grouptags)
    ("Português" . ?p)
    ("Matemática" . ?m)
    ("Física"     . ?f)
    ("História"   . ?h)
    ("Inglês"     . ?i)
    ("Química"    . ?q)
    ("Redação"    . ?r)
    ("Sociologia" . ?s)
    (:endgroup)
    (:startgroup)
    ("Técnico" . ?T)
    (:grouptags)
    ("PDM"        . ?d)
    ("TCC"        . ?t)
    ("PS"         . ?a)
    ("RC"         . ?c)
    ("SO"         . ?o)
    ("TEI"        . ?e)
    (:endgroup)

    ;; Other major tags
    ("@mandarim" . ?M)
    ("@redacao"  . ?R)
    ("@pessoal"  . ?P)
    (:endgroup)))

(setq org-capture-templates
  '(("t" "Tasks")
    ("tt" "Task" entry (file+olp "~/Documents/Org/Agenda/Tasks.org" "Inbox")
      "* TODO %?\n%U\n%a\n%i" :empty-lines 1)
    ("m" "Email")
    ("mr" "Read Later" entry (file+olp "~/Documents/Org/Agenda/Tasks.org" "Email")
      "* TODO Read %:subject from %:from\n%a\n%U\n\n%i" :empty-lines 1 :immediate-finish t)))
(lhgh/leader-maps
  "oc" '(org-capture :which-key "capture"))

(setq org-agenda-files
  '("~/Documents/Org/Agenda/Tasks.org"
    "~/Documents/Org/Agenda/Habits.org"))
(setq org-log-done 'time)

(lhgh/leader-maps
  "oa" '(org-agenda :which-key "agenda"))

;; Custom agenda views
(setq org-agenda-custom-commands
  '(("d" "Dashboard"
     ((agenda "" ((org-deadline-warning-days 7)))
      (tags-todo "+@CEFET"
        ((org-agenda-overriding-header "Next CEFET Tasks")
         (org-agenda-max-todos 5)))
      (tags-todo "+@mandarim|@redacao|@pessoal"
        ((org-agenda-overriding-header "Next Other Tasks")))))))

(require 'org-habit)
(add-to-list 'org-modules 'org-habit)
(setq org-habit-graph-column 60)

(with-eval-after-load 'org
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)
     (python . t)
     (scheme . t)
     (latex . t))))

(with-eval-after-load 'org
