Emacs.org
** Structure Templates
Insert empty structural blocks, such as =#+begin_src= … =#+end_src=, by pressing TAB after the string "<KEY".

#+begin_src emacs-lisp
  (with-eval-after-load 'org
    (require 'org-tempo)
    (add-to-list 'org-modules 'org-tempo)

    ;; Custom templates for specific languages
    (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
    (add-to-list 'org-structure-template-alist '("py" . "src python"))
    (add-to-list 'org-structure-template-alist '("sc" . "src scheme"))
    (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp")))
#+end_src

** LaTeX workflow
For academic documents, I'm starting to use Org mode for the general content and LaTeX for formatting.

#+begin_src emacs-lisp
  (with-eval-after-load 'ox-latex
    (add-to-list 'org-latex-classes
                 '("homework"
                   "\\documentclass[11pt]{article}
[NO-DEFAULT-PACKAGES]
[PACKAGES]
\\usepackage[]{babel}
\\pagenumbering{gobble}
\\usepackage[margin=0.5in]{geometry}
\\usepackage{enumitem}
\\usepackage{hyperref}

[EXTRA]


"
                   ("\\section{%s}" . "\\section*{%s}")
                   ("\\subsection{%s}" . "\\subsection*{%s}")
                   ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
                   ("\\paragraph{%s}" . "\\paragraph*{%s}")
                   ("\\subparagraph{%s}" . "\\subparagraph*{%s}"))))
#+end_src

** End =use-package=

#+begin_src emacs-lisp
;; This ends the use-package org block
)
#+end_src

** Update TOC on Save
ToC (Table of Contents) sections are nice in documentation and literate configs. [[https://github.com/alphapapa/org-make-toc][org-make-toc]] enables you to automatically update the ToC in any header with the property =TOC=.

#+begin_src emacs-lisp
  (use-package org-make-toc
    :defer)
#+end_src

*Guix Packages*

#+begin_src scheme

  "emacs-org-make-toc"

#+end_src

** Citations

I make use of Org's built-in citation system through [[https://github.com/bdarcus/citar][citar]].

#+begin_src emacs-lisp
  (use-package citar
    :no-require
    :custom
    (org-cite-global-bibliography '("~/Documents/biblio.bib"))
    (citar-library-paths '("~/Documents/Library"))
    (org-cite-insert-processor 'citar)
    (org-cite-follow-processor 'citar)
    (org-cite-activate-processor 'citar)
    (citar-bibliography org-cite-global-bibliography)
    ;; optional: org-cite-insert is also bound to C-c C-x C-@
    (citar-symbols `((file ,(all-the-icons-faicon "file-o" :face 'all-the-icons-green :v-adjust -0.1) . " ")
                     (note ,(all-the-icons-material "speaker_notes" :face 'all-the-icons-blue :v-adjust -0.3) . " ")
                     (link ,(all-the-icons-octicon "link" :face 'all-the-icons-orange :v-adjust 0.01) . " ")))
    (citar-symbol-separator "  ")
    :bind
    (:map org-mode-map :package org
          ("C-c b" . #'org-cite-insert))
    :config
    (with-eval-after-load 'citar
      (define-key citar-map (kbd "d") (cons "download entry" #'citar-download-entry))))
#+end_src

*Guix Packages*

#+begin_src scheme
  "emacs-citar"
#+end_src

** Org Roam

#+begin_src emacs-lisp
  (use-package org-roam
    :after org
    :init
    (setq org-roam-v2-ack t)
    :custom
    (org-roam-directory "~/Documents/Org/org-roam")
    (org-roam-capture-templates
     '(("m" "main" plain
        "%?"
        :if-new (file+head "main/${slug}.org"
                           "#+title: ${title}\n")
        :unnarrowed t)
       ("r" "reference" plain "%?"
        :if-new (file+head "reference/${title}.org"
                           "#+title: ${title}\n")
        :unnarrowed t)
       ("b" "bibliography reference" plain "%?"
          :if-new
          (file+head "reference/${citekey}.org" "#+title: ${author} :: ${title}\n")
          :unnarrowed t)))
    (org-roam-node-display-template
     (concat "${type:15} ${title:*} " (propertize "${tags:10}" 'face 'org-tag)))
    :general
    (lhgh/ctrl-c-binds
      "n" '(:ignore t :which-key "notes")
      "nl" 'org-roam-buffer-toggle
      "nf" 'org-roam-node-find
      "ni" 'org-roam-node-insert)
    :config
    (org-roam-db-autosync-enable)
    (cl-defmethod org-roam-node-type ((node org-roam-node))
      "Return the TYPE of NODE."
      (condition-case nil
          (file-name-nondirectory
           (directory-file-name
            (file-name-directory
             (file-relative-name (org-roam-node-file node) org-roam-directory))))
        (error "")))
    (add-to-list 'display-buffer-alist
                 '("\\*org-roam\\*"
                   (display-buffer-in-direction)
                   (direction . right)
                   (window-width . 0.33)
                   (window-height . fit-window-to-buffer))))

  (use-package org-roam-bibtex
    :after org-roam
    :hook (org-roam-mode . org-roam-bibtex-mode)
    :custom
    (orb-roam-ref-format 'org-cite)
    (bibtex-completion-bibliography org-cite-global-bibliography)
    (bibtex-completion-notes-path org-roam-directory)
    (bibtex-completion-library-path "~/Documents/Library"))
#+end_src

*Guix Packages*

#+begin_src scheme

  "emacs-org-roam"
  "emacs-org-roam-bibtex"

#+end_src

** Flashcards

I use [[https://github.com/louietan/anki-editor][anki-editor]] to include flashcards on certain Org documents. I use them to review their contents.

#+begin_src emacs-lisp
  (use-package anki-editor
    :defer t)
#+end_src

*Guix Packages*

Obs: this is commented at the time due to guix's Anki being broken ATM.

#+begin_src scheme
  ;; "emacs-anki-editor"
  ;; "anki"
#+end_src

** Packages

*** org-superstar
[[https://github.com/integral-dw/org-superstar-mode][org-superstar]] prettifies headings and plain lists in Org mode. A direct descendant of [[https://github.com/sabof/org-bullets][org-bullets]].

#+begin_src emacs-lisp
  (use-package org-superstar
    :hook (org-mode . org-superstar-mode)
    :custom
    (org-superstar-headline-bullets-list '("◉" "○" "●" "○" "●" "○" "●"))
    (org-superstar-remove-leading-stars t))
#+end_src

*Guix Packages*

#+begin_src scheme

  "emacs-org-superstar"

#+end_src

*** grip-mode
[[https://github.com/seagle0128/grip-mode][grip-mode]] provides instant Github-flavored Markdown/Org preview using [[https://github.com/joeyespo/grip][Grip]] (GitHub Readme Instant Preview).

#+begin_src emacs-lisp
(use-package grip-mode
  :straight t
  :defer t
  :general
  (lhgh/leader-maps '(markdown-mode-map gfm-mode-map org-mode-map)
    "vg" '(grip-mode :which-key "toggle grip preview"))
  :config
  ;; When nil, update the preview after file saves only, instead of also
  ;; after every text change
  (setq grip-update-after-change nil))
#+end_src

*** org-mime
[[https://github.com/org-mime/org-mime][org-mime]] can be used to send HTML email using Org-mode HTML export.

#+begin_src emacs-lisp
  (use-package org-mime
    :config
    (setq org-mime-export-options '(:section-numbers nil
                                    :with-author nil
                                    :with-toc nil))
    (add-hook 'message-send-hook 'org-mime-confirm-when-no-multipart))
#+end_src

*Guix Packages*

#+begin_src scheme

  "emacs-org-mime"

#+end_src

*** org-appear
With [[https://github.com/awth13/org-appear][org-appear]], hidden element parts appear when the cursor enters an element and disappear when it leaves.

#+begin_src emacs-lisp
  (use-package org-appear
    :after org
    :straight (org-appear
               :type git :host github :repo "awth13/org-appear")
    :hook (org-mode . org-appear-mode)
    :custom
    (org-appear-autolinks t))
#+end_src

** Auto-tangle Configuration Files
This snippet adds a hook to =org-mode= buffers so that any Org file in the =.dotfiles= folder when saved gets auto tangled on save.

#+begin_src emacs-lisp
  ;; Automatically tangle our Emacs.org config file when we save it
  (defun lhgh/org-babel-tangle-config ()
    (when (string-equal (file-name-directory (buffer-file-name))
                        (expand-file-name "~/.dotfiles/"))
      ;; Dynamic scoping to the rescue
      (let ((org-confirm-babel-evaluate nil))
        (org-babel-tangle))))

  (add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'lhgh/org-babel-tangle-config)))
#+end_src

* Development

** Binding Prefixes

#+begin_src emacs-lisp
  (lhgh/leader-maps
    "v" '(:ignore t :which-key "previews")
    "m" '(:ignore t :which-key "mode")
    "mt" '(:ignore t :which-key "toggle")
    "r" '(:ignore t :which-key "generate"))
#+end_src

** Projectile
[[https://github.com/bbatsov/projectile][Projectile]] brings project capabilities to Emacs.

#+begin_src emacs-lisp
  (use-package projectile
    :config (projectile-mode)
    :bind-keymap ("C-c p" . projectile-command-map)
    :general
    (lhgh/leader-maps
      "p"  '(:ignore t :which-key "projectile")
      "pp" '(projectile-switch-project :which-key "switch-project")
      "pf" '(projectile-find-file :which-key "find-file")
      "pF" '(projectile-find-file-other-window :which-key "find-file-other-window")
      "pq" '(projectile-kill-buffers :which-key "quit project")
      "pt" '(projectile-test-project :which-key "test-project"))
    :init
    (when (file-directory-p "~/Projects/Code")
      (setq projectile-project-search-path '("~/Projects/Code")))
    (setq projectile-switch-project-action #'projectile-dired))
#+end_src

*Guix Packages*

#+begin_src scheme

  "emacs-projectile"

#+end_src

*** counsel-projectile
[[https://github.com/ericdanan/counsel-projectile][counsel-projectile]] provides further ivy integration into projectile. (not using at the moment, see [[*Old Setup (Ivy)][here]])

#+begin_src emacs-lisp :tangle no
  (use-package counsel-projectile
    :after projectile
    :config (counsel-projectile-mode))
#+end_src

** Git

*** Magit
[[https://github.com/magit/magit][Magit]] is an interface to Git, implemented as an Emacs package. It's the best I have used or heard about.

#+begin_src emacs-lisp
  (use-package magit
    :commands (magit-status magit-get-current-branch)
    :general
    (lhgh/leader-maps
      "g"  '(:ignore t :which-key "git")
      "gg" 'magit-status))

  (use-package magit-todos ;; shows TODOs (or similars) in files inside the repo
    :after magit)
#+end_src

*Guix Packages*

#+begin_src scheme

  "emacs-magit"
  "emacs-magit-todos"

#+end_src

*** Forge
[[https://magit.vc/manual/forge/][Forge]] allows you to work with Git forges, such as Github and Gitlab, from the comfort of Magit and the rest of Emacs.
NOTE: Remember to configure GitHub and/or GitLab tokens before using this package. [[https://magit.vc/manual/forge/Token-Creation.html#Token-Creation][Click here]] for documentation on this.

#+begin_src emacs-lisp
  (use-package forge
    :after magit)
#+end_src

*Guix Packages*

#+begin_src scheme

  "emacs-forge"

#+end_src

