.emacs.d/init.el
  (require 'org-tempo)
  (add-to-list 'org-modules 'org-tempo)

  ;; Custom templates for specific languages
  (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
  (add-to-list 'org-structure-template-alist '("py" . "src python"))
  (add-to-list 'org-structure-template-alist '("sc" . "src scheme"))
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp")))

(with-eval-after-load 'ox-latex
    (add-to-list 'org-latex-classes
                 '("homework"
                   "\\documentclass[11pt]{article}
[DEFAULT-PACKAGES]
\\usepackage[]{babel}
\\pagenumbering{gobble}
\\usepackage[margin=0.5in]{geometry}
\\usepackage{enumitem}"
                   ("\\section{%s}" . "\\section*{%s}")
                   ("\\subsection{%s}" . "\\subsection*{%s}")
                   ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
                   ("\\paragraph{%s}" . "\\paragraph*{%s}")
                   ("\\subparagraph{%s}" . "\\subparagraph*{%s}"))))

;; This ends the use-package org block
)

(use-package org-make-toc
  :hook (org-mode . org-make-toc-mode))

(use-package org-superstar
  :hook (org-mode . org-superstar-mode)
  :custom
  (org-superstar-headline-bullets-list '("◉" "○" "●" "○" "●" "○" "●"))
  (org-superstar-remove-leading-stars t))

(use-package grip-mode
  :straight t
  :defer t
  :general
  (lhgh/leader-maps '(markdown-mode-map gfm-mode-map org-mode-map)
    "vg" '(grip-mode :which-key "toggle grip preview"))
  :config
  ;; When nil, update the preview after file saves only, instead of also
  ;; after every text change
  (setq grip-update-after-change nil))

(use-package org-mime
  :config
  (setq org-mime-export-options '(:section-numbers nil
                                  :with-author nil
                                  :with-toc nil))
  (add-hook 'message-send-hook 'org-mime-confirm-when-no-multipart))

(use-package org-appear
  :after org
  :straight (org-appear
             :type git :host github :repo "awth13/org-appear")
  :hook (org-mode . org-appear-mode)
  :custom
  (org-appear-autolinks t))

;; Automatically tangle our Emacs.org config file when we save it
(defun lhgh/org-babel-tangle-config ()
  (when (string-equal (file-name-directory (buffer-file-name))
                      (expand-file-name "~/.emacs.d/"))
    ;; Dynamic scoping to the rescue
    (let ((org-confirm-babel-evaluate nil))
      (org-babel-tangle))))

(add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'lhgh/org-babel-tangle-config)))

(lhgh/leader-maps
  "v" '(:ignore t :which-key "previews")
  "m" '(:ignore t :which-key "mode")
  "mt" '(:ignore t :which-key "toggle")
  "r" '(:ignore t :which-key "generate"))

(use-package projectile
  :config (projectile-mode)
  :bind-keymap ("C-c p" . projectile-command-map)
  :general
  (lhgh/leader-maps
    "p"  '(:ignore t :which-key "projectile")
    "pp" '(projectile-switch-project :which-key "switch-project")
    "pf" '(projectile-find-file :which-key "find-file")
    "pF" '(projectile-find-file-other-window :which-key "find-file-other-window")
    "pq" '(projectile-kill-buffers :which-key "quit project")
    "pt" '(projectile-test-project :which-key "test-project"))
  :init
  (when (file-directory-p "~/Projects/Code")
    (setq projectile-project-search-path '("~/Projects/Code")))
  (setq projectile-switch-project-action #'projectile-dired))

(use-package magit
  :commands (magit-status magit-get-current-branch)
  :general
  (lhgh/leader-maps
    "g"  '(:ignore t :which-key "git")
    "gg" 'magit-status))

(use-package magit-todos ;; shows TODOs (or similars) in files inside the repo 
  :defer t)

(use-package forge
  :init
  (setq auth-sources '("~/.authinfo"))
  :after magit)
