Emacs.org
** Language Server Protocol
LSP is IMO one of the most important contributions Microsoft has ever done to the dev community and surely the best aspect of the creation of Visual Studio Code. It makes possible to have IDE level features in almost any text editor, from VSCode itself to (Neo)vim and Emacs.

#+begin_src emacs-lisp
  (use-package lsp-mode
    :straight t
    :commands (lsp lsp-deferred)
    :init
    (setq lsp-keymap-prefix "C-c l")
    :bind (:map lsp-mode-map
           ("TAB" . completion-at-point))
    :custom
    (lsp-completion-provider :none)
    :config
    (lsp-enable-which-key-integration t))

  (use-package lsp-ui
    :straight t
    :hook (lsp-mode . lsp-ui-mode)
    :custom
    (lsp-eldoc-enable-hover nil)
    ;; (lsp-ui-doc-position 'bottom))
    (lsp-lens-enable nil)
    (lsp-ui-sideline-show-code-actions nil)
    (lsp-ui-sideline-show-hover nil)
    (lsp-signature-render-documentation nil)
    (lsp-ui-doc-show-with-cursor nil))
#+end_src

*** Add .local/bin to exec path for lsp servers
I like to install my language servers to =.local/bin=. This is good because it mantains the installation at a user level. =lsp-mode= finds lsp server executables by executing =executable-find=, which searches in the folders listed in =exec-path=.

#+begin_src emacs-lisp
  (push "~/.local/bin" exec-path)
#+end_src

** Debug Adapter Protocol
The second best contribution from VSCode, debugger integration for any editor.
- [[https://emacs-lsp.github.io/dap-mode/page/configuration/][dap-mode configuration page]]

#+begin_src emacs-lisp
  (use-package dap-mode
    :straight t
    :after lsp-mode
    :custom
    (lsp-emable-dap-auto-configure nil)
    :config
    (dap-ui-mode 1)
    :general
    (lhgh/leader-maps
      "d"  '(:ignore t :which-key "debugger")
      "dd" '(dap-debug "debug")
      "dl" '(dap-debug-last :which-key "debug-last")
      "dr" '(dap-debug-recent :which-key "debug-recent")
      "du" '(:ignore t :which-key "ui")
      "dur" '(dap-ui-repl :which-key "repl")
      "dul" '(dap-ui-locals :which-key "locals")
      "dub" '(dap-ui-breakpoints :which-key "breakpoints")
      "due" '(dap-ui-expressions :which-key "expresions")
      "dh" '(dap-hydra :which-key "dap-hydra")
      "db" '(:ignore t :which-key "breakpoints")
      "dbt" '(dap-breakpoint-toggle :which-key "toggle")
      "dbl" '(dap-breakpoint-log-message :which-key "log-message")
      "dbc" '(dap-breakpoint-condition :which-key "condition")
      "ds" '(dap-switch-stack-frame :which-key "stack-frame")
      "dq" '(dap-disconnect :which-key "disconnect")
      "de" '(dap-debug-edit-template :which-key "edit-template")))
#+end_src

** Snippets
For snippets, I use yasnippets.

#+begin_src emacs-lisp
  (use-package yasnippet
    :hook ((prog-mode . yas-minor-mode)
           (org-mode . yas-minor-mode))
    :config
    (add-to-list 'yas-snippet-dirs "~/.emacs.d/snippets")

    ;; Remove yas-expand from tab
    (define-key yas-minor-mode-map (kbd "<tab>") nil)
    (define-key yas-minor-mode-map (kbd "TAB") nil)

    ;; Bind yas-expand to C-tab
    (define-key yas-minor-mode-map (kbd "C-<tab>") #'yas-expand)
    (yas-reload-all))
#+end_src

*Guix Packages*

#+begin_src scheme

  "emacs-yasnippet"
  "emacs-yasnippet-snippets"

#+end_src

** Languages

*** Meta Lisp

#+begin_src emacs-lisp
  (use-package lispy
    ;; :disabled
    :hook ((emacs-lisp-mode . lispy-mode)
           (scheme-mode . lispy-mode)))

  (use-package lispyville
    ;; :disabled
    :hook (lispy-mode . lispyville-mode)
    :config
    (lispyville-set-key-theme
     '(operators c-w additional prettify additional-movement)))

  (use-package symex
    :disabled
    :hook ((emacs-lisp-mode . symex-mode)
           (scheme-mode . symex-mode))
    :general
    (symex-mode-map
     "C-;" 'symex-mode-interface)
    :custom
    (symex-modal-backend 'evil)
    :config
    (symex-initialize))
#+end_src

*Guix Packages*

#+begin_src scheme

  "emacs-lispy"
  "emacs-lispyville"
  "emacs-symex"

#+end_src

*** Emacs Lisp

#+begin_src emacs-lisp
  (add-hook 'emacs-lisp-mode-hook #'flycheck-mode)
#+end_src

*** Scheme Lisp

#+begin_src emacs-lisp
  (use-package geiser
    :hook (scheme-mode . geiser-mode))
#+end_src

*Guix Packages*

#+begin_src scheme

  "emacs-geiser"
  "emacs-geiser-guile"

#+end_src

*** Common Lisp

#+begin_src emacs-lisp
  (use-package sly
    :mode "\\.lisp\\'")
#+end_src

*Guix Packages*

#+begin_src scheme

  "emacs-sly"

#+end_src


*** Nix

#+begin_src emacs-lisp
  (use-package nix-mode
    :mode "\\.nix\\'")
#+end_src

*Guix Packages*

#+begin_src scheme

  "emacs-nix-mode"

#+end_src

*** Haskell

#+begin_src emacs-lisp
  (use-package haskell-mode
    :hook ((haskell-mode . interactive-haskell-mode)
           (haskell-mode . haskell-indent-mode)
           (haskell-mode . haskell-doc-mode)
           (haskell-mode . flycheck-mode))
   :config
   (flycheck-add-next-checker 'haskell-ghc '(info . haskell-hlint)))

  (use-package hindent
    :after haskell-mode
    :hook (haskell-mode . hindent-mode))

  (use-package dante
    ;; :straight t
    :disabled t
    :after haskell-mode
    :commands 'dante-mode
    :hook ((haskell-mode . flycheck-mode)
           (haskell-mode . dante-mode))
    :config
    (flycheck-add-next-checker 'haskell-dante '(info . haskell-hlint)))
#+end_src

*Guix Packages*

#+begin_src scheme

  "emacs-haskell-mode"
  "emacs-dante" ;; outdated version
  "ghc" ;; for haskell-interactive-mode
  "ghc-hindent"
  "hlint"

#+end_src

*** TypeScript

#+begin_src emacs-lisp
(use-package typescript-mode
  :mode "\\.ts\\'"
  :hook (typescript-mode . lsp-deferred)
  :config
  (setq typescript-indent-level 2)

  ;; debugger
  (require 'dap-node)
  (dap-node-setup)) ;; Automatically installs Node debug adapter if needed
#+end_src

*Guix Packages*

#+begin_src scheme

  "emacs-typescript-mode"

#+end_src

*** Python

#+begin_src emacs-lisp
  (use-package python-mode
    ;; :hook (python-mode . lsp-deferred)
    :straight (:type built-in)
    :general
    (lhgh/leader-maps python-mode-map
      "mr"  '(:ignore t :which-key "repl")
      "mrr" '(run-python :which-key "run repl")
      "mre" '(python-shell-send-region :which-key "send region to repl")
      "mrE" '(python-shell-send-buffer :which-key "send buffer to repl")
      "mrf" '(python-shell-send-defun :which-key "send function to repl")
      "mrF" '(python-shell-send-file :which-key "send file to repl"))
    :custom
    (python-shell-interpreter "python3")
    (dap-python-executable "python3")
    (dap-python-debugger 'debugpy)
    )

  (use-package lsp-pyright
    :straight t
    :hook (python-mode . (lambda ()
                            (require 'lsp-pyright)
                            (lsp-deferred)
                            (require 'dap-python))))

  (use-package pipenv
    :straight t
    :hook (python-mode . pipenv-mode))

  (use-package python-docstring
    :hook (python-mode . python-docstring-mode)
    :straight '(:type git
                :host github
                :repo "glyph/python-docstring-mode"))
#+end_src

*** Dart
Used primarily for Flutter.

#+begin_src emacs-lisp
  (use-package dart-mode
    :mode "\\.dart\\'")

  (use-package lsp-dart
    :straight t
    :hook (dart-mode . lsp-deferred)
    :custom
    (lsp-dart-flutter-sdk-dir (if lhgh/is-guix-system
                                  (string-trim (shell-command-to-string "find /nix/store -regex \".*flutter\-.*\-unwrapped$\""))
                                "~/.local/share/flutter"))
    (lsp-dart-sdk-dir (concat lsp-dart-flutter-sdk-dir "/bin/cache/dart-sdk")))

  (use-package flutter
    :straight t
    :after dart-mode
    :general
    (lhgh/leader-maps dart-mode-map
      "mr" '(flutter-run-or-hot-reload :which-key "hot reload")))
#+end_src

*Guix Packages*

#+begin_src scheme

  "emacs-dart-mode"

#+end_src

*** Markdown

**** markdown-mode
[[https://github.com/jrblevin/markdown-mode][markdown-mode]] package provides major modes for generic markdown and github flavoured markdown (gfm). I use [[https://github.com/markedjs/marked][Marked]] as my markdown processor for rendering HTML for preview and export.

#+begin_src emacs-lisp
  (use-package markdown-mode
    :mode ("README\\.md\\'" . gfm-mode)
    :init (setq makrdown-command "marked"))
#+end_src

*Guix Packages*

#+begin_src scheme

  "emacs-markdown-mode"

#+end_src

**** markdown-toc
[[https://github.com/ardumont/markdown-toc][markdown-toc]] generates TOCs in markdown files.

#+begin_src emacs-lisp
  (use-package markdown-toc
    :straight t
    :after markdown-mode
    :general
    (lhgh/leader-maps '(markdown-mode-map gfm-mode-map)
      "rt" '(markdown-toc-generate-or-refresh-toc :which-key "generate or refresh markdown toc")))
#+end_src

*** HTML

#+begin_src emacs-lisp
  (use-package web-mode
    :mode "(\\.\\(html?\\|ejs\\|tsx\\|jsx\\)\\'"
    :hook (web-mode . lsp-deferred)
    :config
    (setq-default web-mode-code-indent-offset 2)
    (setq-default web-mode-markup-indent-offset 2)
    (setq-default web-mode-attribute-indent-offset 2))
#+end_src

*Guix Packages*

#+begin_src scheme

  "emacs-web-mode"

#+end_src

**** Tailwind CSS
Check out Tailwind [[https://tailwindcss.com/][here]].
#+begin_src emacs-lisp
  (use-package lsp-tailwindcss
    :straight '(:type git
                :host github
                :repo "merrickluo/lsp-tailwindcss"))
#+end_src

*** Shell scripting

#+begin_src emacs-lisp
  (defun lhgh/sh-mode-config()
    (flycheck-select-checker 'sh-shellcheck))

  (add-hook 'sh-mode-hook #'flycheck-mode)
  (add-hook 'sh-mode-hook #'lhgh/sh-mode-config)
#+end_src

*Guix Packages*

#+begin_src scheme
  "shellcheck"
#+end_src

** Productivity

*** Syntax checking with Flycheck

#+begin_src emacs-lisp
  (use-package flycheck
    :hook (lsp-mode . flycheck-mode))
#+end_src

*Guix Packages*

#+begin_src scheme

  "emacs-flycheck"

#+end_src

*** Raibow Delimiters
[[https://github.com/Fanael/rainbow-delimiters][raibow-delimeters]] helps spotting matching delimiters, orienting yourself in the code and telling which statements are at a given depth.

#+begin_src emacs-lisp
  (use-package rainbow-delimiters
    :hook (prog-mode . rainbow-delimiters-mode))
#+end_src

*Guix Packages*

#+begin_src scheme

  "emacs-rainbow-delimiters"

#+end_src

*** Rainbow Mode

#+begin_src emacs-lisp
  (use-package rainbow-mode
    :hook (text-mode . rainbow-mode))
#+end_src

*Guix Packages*

#+begin_src scheme
  "emacs-rainbow-mode"
#+end_src

*** Highlight TODOs

#+begin_src emacs-lisp
  (use-package hl-todo
    :hook (prog-mode . hl-todo-mode))
#+end_src

*Guix Packages*

#+begin_src scheme

  "emacs-hl-todo"

#+end_src

** Tree-Sitter

#+begin_src emacs-lisp
  (use-package tree-sitter
    :straight t
    :init
    (global-tree-sitter-mode)
    (add-hook 'tree-sitter-after-on-hook #'tree-sitter-hl-mode))
  (use-package tree-sitter-langs
    :after tree-sitter
    :straight t)
#+end_src

** Direnv
I have started to use =direnv= to automatically enable =guix shell= environments. [[https://github.com/purcell/envrc][envrc]] permits enabling those on a per-buffer basis.

#+begin_src emacs-lisp
  (use-package envrc
    :after projectile
    :config
    (envrc-global-mode))
#+end_src

*Guix Packages*

#+begin_src scheme
  "emacs-envrc"
  "direnv"
#+end_src

* Applications

** Binding Prefix

#+begin_src emacs-lisp
  (lhgh/leader-maps
    "a" '(:ignore t :which-key "applications"))
#+end_src

