.emacs.d/init.el

(use-package lsp-mode
  :straight t
  :commands (lsp lsp-deferred)
  :init
  (setq lsp-keymap-prefix "C-c l")
  :bind (:map lsp-mode-map
         ("TAB" . completion-at-point))
  :config
  (lsp-enable-which-key-integration t))

(use-package lsp-ui
  :straight t
  :hook (lsp-mode . lsp-ui-mode)
  :custom
  (lsp-eldoc-enable-hover nil)
  ;; (lsp-ui-doc-position 'bottom))
  (lsp-lens-enable nil)
  (lsp-ui-sideline-show-code-actions nil)
  (lsp-ui-sideline-show-hover nil)
  (lsp-signature-render-documentation nil)
  (lsp-ui-doc-show-with-cursor nil))

(push "~/.local/bin" exec-path)

(use-package dap-mode
  :straight t
  :after lsp-mode
  :custom
  (lsp-emable-dap-auto-configure nil)
  :config
  (dap-ui-mode 1)
  :general
  (lhgh/leader-maps
    "d"  '(:ignore t :which-key "debugger")
    "dd" '(dap-debug "debug")
    "dl" '(dap-debug-last :which-key "debug-last")
    "dr" '(dap-debug-recent :which-key "debug-recent")
    "du" '(:ignore t :which-key "ui")
    "dur" '(dap-ui-repl :which-key "repl")
    "dul" '(dap-ui-locals :which-key "locals")
    "dub" '(dap-ui-breakpoints :which-key "breakpoints")
    "due" '(dap-ui-expressions :which-key "expresions")
    "dh" '(dap-hydra :which-key "dap-hydra")
    "db" '(:ignore t :which-key "breakpoints")
    "dbt" '(dab-breakpoint-toggle :which-key "toggle")
    "dbl" '(dap-breakpoint-log-message :which-key "log-message")
    "dbc" '(dap-breakpoint-condition :which-key "condition")
    "ds" '(dap-switch-stack-frame :which-key "stack-frame") 
    "dq" '(dap-disconnect :which-key "disconnect")
    "de" '(dap-debug-edit-template :which-key "edit-template")))

(add-hook 'emacs-lisp-mode-hook #'flycheck-mode)

(use-package typescript-mode
  :mode "\\.ts\\'"
  :hook (typescript-mode . lsp-deferred)
  :config
  (setq typescript-indent-level 2)

  ;; debugger
  (require 'dap-node)
  (dap-node-setup)) ;; Automatically installs Node debug adapter if needed

(use-package python-mode
  ;; :hook (python-mode . lsp-deferred)
  :straight (:type built-in)
  :general
  (lhgh/leader-maps python-mode-map
    "mr"  '(:ignore t :which-key "repl")
    "mrr" '(run-python :which-key "run repl")
    "mre" '(python-shell-send-region :which-key "send region to repl")
    "mrE" '(python-shell-send-buffer :which-key "send buffer to repl")
    "mrf" '(python-shell-send-file :which-key "send function to repl")
    "mrF" '(python-shell-send-defun :which-key "send file to repl"))
  :custom
  (python-shell-interpreter "python3")
  (dap-python-executable "python3")
  (dap-python-debugger 'debugpy)
  :config
  (require 'dap-python))

(use-package lsp-pyright
  :straight t
  :hook (python-mode . (lambda ()
                          (require 'lsp-pyright)
                          (lsp-deferred))))

(use-package dart-mode
  :mode "\\.dart\\'")

(use-package lsp-dart
  :straight t
  :hook (dart-mode . lsp-deferred)
  :custom
  (lsp-dart-flutter-sdk-dir (if lhgh/is-guix-system
                                (string-trim (shell-command-to-string "find /nix/store -regex \".*flutter\-.*\-unwrapped$\""))
                              "~/.local/share/flutter"))
  (lsp-dart-sdk-dir (concat lsp-dart-flutter-sdk-dir "/bin/cache/dart-sdk")))

(use-package flutter
  :straight t
  :after dart-mode
  :general
  (lhgh/leader-maps dart-mode-map
    "mr" '(flutter-run-or-hot-reload :which-key "hot reload")))

(use-package markdown-mode
  :mode ("README\\.md\\'" . gfm-mode)
  :init (setq makrdown-command "marked"))

(use-package markdown-toc
  :straight t
  :after markdown-mode
  :general
  (lhgh/leader-maps '(markdown-mode-map gfm-mode-map)
    "rt" '(markdown-toc-generate-or-refresh-toc :which-key "generate or refresh markdown toc")))

(use-package web-mode
  :mode "(\\.\\(html?\\|ejs\\|tsx\\|jsx\\)\\'"
  :hook (web-mode . lsp-deferred)
  :config
  (setq-default web-mode-code-indent-offset 2)
  (setq-default web-mode-markup-indent-offset 2)
  (setq-default web-mode-attribute-indent-offset 2))

(use-package lsp-tailwindcss
  :straight '(:type git
              :host github
              :repo "merrickluo/lsp-tailwindcss"))

(use-package flycheck
  :hook (lsp-mode . flycheck-mode))

(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode))

(lhgh/leader-maps
  "a" '(:ignore t :which-key "applications"))
