Emacs.org
** Vterm
A native code alternative to =term= and =ansi-term=.

#+begin_src emacs-lisp
  (use-package vterm
    :commands vterm
    :general
    (lhgh/leader-maps
      "at" '(vterm :which-key "vterm"))
    :config
    (setq vterm-max-scrollback 10000))
#+end_src

*Guix Packages*

#+begin_src scheme

  "emacs-vterm"

#+end_src

** Eshell

#+begin_src emacs-lisp
  (defun lhgh/configure-eshell ()
    (require 'evil-collection-eshell)
    (evil-collection-eshell-setup)

    (require 'xterm-color)

    (add-to-list 'eshell-preoutput-filter-functions 'xterm-color-filter)
    (delq 'eshell-handle-ansi-color eshell-output-filter-functions)

    (add-hook 'eshell-before-prompt-hook
              (lambda ()
                (setq xterm-color-preserve-properties t)))

    ;; Truncate buffer for performance
    (add-to-list 'eshell-output-filter-functions 'eshell-truncate-buffer)

    ;; We want to use xterm-256color when running interactive commands
    ;; in eshell but not during other times when we might be launching
    ;; a shell command to gather its output.
    (add-hook 'eshell-pre-command-hook
              (lambda () (setenv "TERM" "xterm-256color")))
    (add-hook 'eshell-post-command-hook
              (lambda () (setenv "TERM" "dumb")))

    ;; Save command history when commands are entered
    (add-hook 'eshell-pre-command-hook 'eshell-save-some-history)

    ;; Truncate buffer for performance
    (add-to-list 'eshell-output-filter-functions 'eshell-truncate-buffer)

    ;; Initialize the shell history
    (eshell-hist-initialize)

    (evil-define-key '(normal emacs insert visual) eshell-mode-map (kbd "C-r") 'consult-history)
    (evil-define-key '(normal emacs insert visual) eshell-mode-map (kbd "<home>") 'eshell-bol)

    ;; Required for keymaps to work
    (evil-normalize-keymaps)

    (setenv "PAGER" "cat")

    (setq eshell-history-size 10000
          eshell-buffer-maximum-lines 10000
          eshell-hist-ignore-dups t
          eshell-scroll-to-bottom-on-input t
          eshell-aliases-file (expand-file-name "~/.emacs.d/eshell/alias")))

  (use-package eshell-git-prompt
    :straight t
    :after eshell)

  (use-package eshell-syntax-highlighting
    :after esh-mode
    :config
    ;; Enable in all Eshell buffers.
    (eshell-syntax-highlighting-global-mode +1))


  (use-package eshell
    :hook ((eshell-first-time-mode . lhgh/configure-eshell)
           (eshell-mode . eshell-alias-initialize))
    :config
    (lhgh/leader-maps
      "ae" '(eshell :which-key "eshell"))

    (with-eval-after-load 'em-term
      (setq eshell-destroy-buffer-when-process-dies t)
      (dolist (program '( "nmtui"
                          "nvim"))
        (add-to-list 'eshell-visual-commands program)))

    (eshell-git-prompt-use-theme 'powerline))
#+end_src

*Guix Packages*

#+begin_src scheme

  "emacs-eshell-syntax-highlighting"
  "emacs-xterm-color"

#+end_src

*** Aliases

#+begin_src conf :tangle .emacs.d/eshell/alias :mkdirp yes
  alias e find-file $1
  alias edit find-file $1
  alias gs magit-status-here
  alias ffo find-file-other-window $1
#+end_src

** File Browsing

*** Dired
Dired is the built in file manager, or, as it likes to call itself, directory editor.

**** Key Bindings/Chords Cheatsheet
Just a cheatsheet with the commands I use most frequently. Disclaimer: this documents my workflow and personal key bindings, if anything you see here doesn't work for you, it's probably something that I binded myself.

***** Navigation

| Key binding/chord | Action                                          |
|-------------------+-------------------------------------------------|
| =J=                 | Jump to file in buffer                          |
| =RET= / =l=           | Select file or directory                        |
| =h=                 | Go to parent directory                          |
| =S-RET= / =g O=       | Open file in "other" window                     |
| =M-RET= / =C-o=       | Show file in "other" window without focusing    |
| =g o=               | Open file but in a "preview" mode, close with =q= |
| =I=                 | Insert subfolder in same buffer                 |

***** Marking Files

| Key binding/chord | Action                                |
|-------------------+---------------------------------------|
| =m=                 | Mark a file                           |
| =u=                 | Unmark a file                         |
| =U=                 | Unmark all files in buffer            |
| =t=                 | Invert marked files in buffer         |
| =% m=               | Mark files using regex                |
| =\*=                | Auto-mark functions                   |
| =K=                 | Hide files ( use =g r= to get them back |

***** Copying/Renaming

| Key binding/chord | Action                                                                                                                    |
|-------------------+---------------------------------------------------------------------------------------------------------------------------|
| =C=                 | Copy marked files or current                                                                                              |
| =R=                 | Rename/move marked files or current                                                                                       |
| =% R=               | Rename/move based on regex                                                                                                |
| =y=                 | (dired-ranger) Copy marked files to clipboard                                                                             |
| =X=                 | (dired-ranger) Move files on clipboard                                                                                    |
| =p=                 | (dired-ranger) Paste files on clipboard                                                                                   |
| =C-x C-q=           | Make all file names in buffer editable directly to rename. Kinda like bulk renaming. Press =Z Z= to confirm or =Z Q= to abort |

***** Deleting

| Key binding/chord | Action                               |
|-------------------+--------------------------------------|
| =D=                 | Delete marked files or current       |
| =d=                 | Mark file for deletion               |
| =x=                 | Delete marked for deletion (d) files |

***** Creating and Extracting

| Key binding/chord            | Action                                                              |
|------------------------------+---------------------------------------------------------------------|
| =Z=                            | Compress a file or folder to =.tar.gz= or uncompress the current file |
| =c=                            | Compress current file or marked files to a specific file            |
| =dired-compress-file-alist=    | Variable that binds compression commands to file extensions (=c=)     |
| =dired-compress-file-suffixes= | Variable that binds decompression commands to file extensions (=Z=)   |

***** Other common operations

| Key bindings/chords | Actions                                 |
|---------------------+-----------------------------------------|
| =g r=                 | Refresh buffer (to see changes on disk) |
| =M=                   | Change file mode                        |
| =O=                   | Change file owner                       |
| =g G=                 | Change file group                       |
| =S=                   | Create symlink                          |
| =L=                   | Load an Elisp file into Emacs           |
| =H=                   | Toggle omit mode                        |

**** Configuration

#+begin_src emacs-lisp
  (use-package all-the-icons-dired
    :defer t)

  (use-package dired
    :straight (:type built-in)
    :defer t
    :commands (dired dired-jump)
    :bind (("C-x C-j" . dired-jump))
    :general
    (lhgh/leader-maps
      "ad" '(dired-jump :which-key "dired-jump"))
    :custom ((dired-listing-switches "-agho --group-directories-first")
             (dired-omit-files "^\\.[^.].*"))
    :config
    (setq delete-by-moving-to-trash t)

    (use-package dired-rainbow
      :after dired
      :config
      (dired-rainbow-define-chmod directory "#6cb2eb" "d.*")
      (dired-rainbow-define html "#eb5286" ("css" "less" "sass" "scss" "htm" "html" "jhtm" "mht" "eml" "mustache" "xhtml"))
      (dired-rainbow-define xml "#f2d024" ("xml" "xsd" "xsl" "xslt" "wsdl" "bib" "json" "msg" "pgn" "rss" "yaml" "yml" "rdata"))
      (dired-rainbow-define document "#9561e2" ("docm" "doc" "docx" "odb" "odt" "pdb" "pdf" "ps" "rtf" "djvu" "epub" "odp" "ppt" "pptx"))
      (dired-rainbow-define markdown "#ffed4a" ("org" "etx" "info" "markdown" "md" "mkd" "nfo" "pod" "rst" "tex" "textfile" "txt"))
      (dired-rainbow-define database "#6574cd" ("xlsx" "xls" "csv" "accdb" "db" "mdb" "sqlite" "nc"))
      (dired-rainbow-define media "#de751f" ("mp3" "mp4" "mkv" "MP3" "MP4" "avi" "mpeg" "mpg" "flv" "ogg" "mov" "mid" "midi" "wav" "aiff" "flac"))
      (dired-rainbow-define image "#f66d9b" ("tiff" "tif" "cdr" "gif" "ico" "jpeg" "jpg" "png" "psd" "eps" "svg"))
      (dired-rainbow-define log "#c17d11" ("log"))
      (dired-rainbow-define shell "#f6993f" ("awk" "bash" "bat" "sed" "sh" "zsh" "vim"))
      (dired-rainbow-define interpreted "#38c172" ("py" "ipynb" "rb" "pl" "t" "msql" "mysql" "pgsql" "sql" "r" "clj" "cljs" "scala" "js"))
      (dired-rainbow-define compiled "#4dc0b5" ("asm" "cl" "lisp" "el" "c" "h" "c++" "h++" "hpp" "hxx" "m" "cc" "cs" "cp" "cpp" "go" "f" "for" "ftn" "f90" "f95" "f03" "f08" "s" "rs" "hi" "hs" "pyc" ".java"))
      (dired-rainbow-define executable "#8cc4ff" ("exe" "msi"))
      (dired-rainbow-define compressed "#51d88a" ("7z" "zip" "bz2" "tgz" "txz" "gz" "xz" "z" "Z" "jar" "war" "ear" "rar" "sar" "xpi" "apk" "xz" "tar"))
      (dired-rainbow-define packaged "#faad63" ("deb" "rpm" "apk" "jad" "jar" "cab" "pak" "pk3" "vdf" "vpk" "bsp"))
      (dired-rainbow-define encrypted "#ffed4a" ("gpg" "pgp" "asc" "bfe" "enc" "signature" "sig" "p12" "pem"))
      (dired-rainbow-define fonts "#6cb2eb" ("afm" "fon" "fnt" "pfb" "pfm" "ttf" "otf"))
      (dired-rainbow-define partition "#e3342f" ("dmg" "iso" "bin" "nrg" "qcow" "toast" "vcd" "vmdk" "bak"))
      (dired-rainbow-define vc "#0074d9" ("git" "gitignore" "gitattributes" "gitmodules"))
      (dired-rainbow-define-chmod executable-unix "#38c172" "-.*x.*"))

    (use-package dired-single
      :straight t
      :defer t)

    (use-package dired-ranger
      :defer t)

    (use-package dired-collapse
      :defer t)

    (add-hook 'dired-mode-hook
              (lambda ()
                ;; (interactive)
                (dired-collapse-mode 1)
                (all-the-icons-dired-mode 1)))

    (evil-collection-define-key 'normal 'dired-mode-map
      "h" 'dired-single-up-directory
      "H" 'dired-omit-mode
      "l" 'dired-single-buffer
      "y" 'dired-ranger-copy
      "X" 'dired-ranger-move
      "p" 'dired-ranger-paste))
#+end_src

*Guix Packages*

#+begin_src scheme

  "emacs-all-the-icons-dired"
  ;; "emacs-dired-single"
  "emacs-dired-hacks"

#+end_src

