Emacs.org
*** Opening Files Externally

#+begin_src emacs-lisp
  (use-package openwith
    :after dired
    :hook (dired-mode . openwith-mode)
    :config
    (setq openwith-associations
          (list
           (list (openwith-make-extension-regexp
                  '("mpg" "mpeg" "mp3" "mp4"
                    "avi" "wmv" "wav" "mov" "flv"
                    "ogm" "ogg" "mkv"))
                 "mpv"
                 '(file))
           (list (openwith-make-extension-regexp
                  '("pdf"))
                 "zathura"
                 '(file))
           (list (openwith-make-extension-regexp
                  '("xbm" "pbm" "pgm" "ppm" "pnm"
                    "gif" "bmp" "tif" "jpeg")) ;; Removed jpg and png because Telega uses them
                 "vimiv"
                 '(file)))))
#+end_src

*Guix Packages*

#+begin_src scheme

  "emacs-openwith"

#+end_src

** Chat
*** Telegram

#+begin_src emacs-lisp
  (use-package telega
    ;; :straight (telega :host github
    ;;                   :branch "master")
    :commands telega
    :custom
    (telega-completing-read-function 'completing-read)
    :config
    (define-key global-map (kbd "C-c t") telega-prefix-map)
    (telega-appindicator-mode 1))
#+end_src

*Guix Packages*

#+begin_src scheme

  "emacs-telega"
  "libwebp" ;; dwebp binary is required by telega

#+end_src

*** ERC
ERC is a builtin IRC client for Emacs.

#+begin_src emacs-lisp
  (use-package erc
      :commands erc
      :config
      ;; general setup
      (setq erc-server "irc.libera.chat"
            erc-nick "luishgh"
            erc-user-full-name "Luis Henrique"
            erc-kill-buffer-on-part t
            erc-auto-query 'bury
            erc-autojoin-channels-alist '(("libera.chat" "#systemcrafters")))

      ;; visual config
      (setq erc-fill-column 120
            erc-fill-function 'erc-fill-static
            erc-fill-static-center 20)

      ;; friends
      (setq erc-pals '("diegovsky"))

      ;; tracking config
      (setq erc-track-exclude '("#emacs" "#guix")
            erc-track-exclude-types '("JOIN" "NICK" "PART" "QUIT" "MODE" "AWAY")
            erc-track-exclude-server-buffer t
            erc-track-shorten-start 8
            erc-track-visibility nil))

  (defun lhgh/connect-irc ()
    (interactive)
    (erc-tls
     :server "irc.libera.chat" :port 7000
     :nick "luishgh" :password (password-store-get "irc/irc.libera.chat")))
#+end_src

*** Discord
=elcord= makes it possible to notify Discord when Emacs is “playing” using the Game Activity feature.

#+begin_src emacs-lisp
  (use-package elcord
    :straight t
    :defer t
    :custom
    (elcord-display-buffer-details nil))
#+end_src

** Elpher
A relatively full-featured gopher and gemini client for GNU Emacs.

#+begin_src emacs-lisp
  (use-package elpher
    :commands elpher)
#+end_src

*Guix Packages*

#+begin_src scheme

  "emacs-elpher"

#+end_src

** LanguageTool

#+begin_src emacs-lisp
  (use-package langtool
    :straight t
    :commands langtool-check
    :config
    (setq langtool-language-tool-server-jar "~/.local/bin/LanguageTool-5.3/languagetool-server.jar"))
#+end_src

** Mail management
Load up the configuration present in [[file:Mail.org][Mail.org]]

#+begin_src emacs-lisp
  (when lhgh/is-guix-system
    ;; Load mu4e from mail profile
    (let ((default-directory (expand-file-name "~/.guix-extra-profiles/mail/mail/share/emacs")))
      (message default-directory)
      (normal-top-level-add-subdirs-to-load-path)))

  (require 'lhgh-mail)
#+end_src

** Pomodoro timer

#+begin_src emacs-lisp
  (use-package pomm
    :commands pomm
    )
#+end_src

*Guix Packages*

#+begin_src scheme

  "emacs-pomm"

#+end_src

** Reference browsing

I use [[https://github.com/cpitclaudel/biblio.el][biblio.el]] to download papers and generate bibtex entries.

#+begin_src emacs-lisp
  (defun lhgh/bibtex-get-key (bibtex-string)
    "Get cite key from BIBTEX-STRING."
    (when (stringp bibtex-string)
      (with-temp-buffer
        (bibtex-mode)
        (insert bibtex-string)
        (bibtex-generate-autokey))))

  (defun lhgh/biblio--selection-insert-at-org-cite-bibfile-callback (bibtex entry)
    "Add BIBTEX (from ENTRY) to end of first file in `org-cite-global-bibliography'."
    (with-current-buffer (find-file-noselect (car org-cite-global-bibliography))
      (save-excursion
        (bibtex-mode)
        (goto-char (point-max))
        (insert "\n")
        (save-restriction
          (narrow-to-region (point) (point-max))
          (insert bibtex)
          (bibtex-clean-entry)
          (let ((current-key (bibtex-key-in-head))
                (new-key (bibtex-generate-autokey)))
            (when (not (string= current-key new-key))
              (message (format "Inserting autokey %s to replace %s" new-key current-key))
              (goto-char (point-min))
              (search-forward current-key)
              (replace-match new-key))))
        (bibtex-sort-buffer)
        (save-buffer)))
    (message "Inserted bibtex entry for %S."
             (biblio--prepare-title (biblio-alist-get 'title entry))))

  (defun lhgh/biblio-selection-insert-at-org-cite-bibfile ()
    "Insert BibTeX of current entry in `org-cite-global-bibliography'."
    (interactive)
    (biblio--selection-forward-bibtex #'lhgh/biblio--selection-insert-at-org-cite-bibfile-callback))

  (defun lhgh/biblio-selection-add-to-collection ()
    "Insert current entry at global-bibliography and download paper to library."
    (interactive)
    (lhgh/biblio-selection-insert-at-org-cite-bibfile)
    (biblio--selection-extended-action #'biblio-download--action))

  (use-package biblio
    :custom
    (biblio-download-directory "~/Documents/Library/")
    :general
    (biblio-selection-mode-map
     "a" #'lhgh/biblio-selection-add-to-collection)
    :init
    (define-advice biblio-download--action (:filter-args (args) replace-identifier-with-key)
      (let* ((record (car args))
             (key nil))
        (biblio--selection-forward-bibtex (lambda (bibtex _)
                                            (setq key (lhgh/bibtex-get-key bibtex))))
        (setf (alist-get 'identifier record) key)
        (list record))))
#+end_src

*Guix Packages*

#+begin_src scheme
  "emacs-biblio"
#+end_src

* Credential Management
The [[https://github.com/zx2c4/password-store/tree/master/contrib/emacs][password-store]] package permits interacting with [[https://www.passwordstore.org/][pass]] inside Emacs. The [[https://elpa.gnu.org/packages/pinentry.html][pinentry]] package allows GnuPG passphrases to be prompted through the minibuffer. This only works if you change your gpg-agent config to use =pinentry-emacs= as its =pinentry-program=. It can be installed through package managers like guix or enabling the emacs USE flag for the pinentry package in portage.

#+begin_src emacs-lisp
  (use-package pinentry
    :straight (:source gnu-elpa-mirror)
    :config
    (setq epg-pinentry-mode 'loopback)
    (pinentry-start))

  (use-package password-store
    :config
    (setq password-store-password-length 15)
    (auth-source-pass-enable)
    :general
    (lhgh/leader-maps
      "ap" '(:ignore t :which-key "pass")
      "app" '(password-store-copy :which-key "copy password")
      "api" '(password-store-insert :which-key "insert password")
      "apg" '(password-store-generate :which-key "generate password")))
#+end_src

*Guix Packages*

#+begin_src scheme

  ;; "emacs-pinentry"
  "pinentry-emacs"
  "emacs-password-store"
  "emacs-auth-source-pass"

#+end_src

* Utility Functions

#+begin_src emacs-lisp
  (defun lhgh/lookup-password (&rest keys)
    "Gets the password for the query from .authinfo.gpg."
    (let ((result (apply #'auth-source-search keys)))
      (if result
          (funcall (plist-get (car result) :secret))
          nil)))
#+end_src

* Runtime Performance
Dial the GC threshold back down so that garbage collection happens more frequently but in less time.

#+begin_src emacs-lisp
 ;; Make gc pauses faster by decreasing the threshold.
  (setq gc-cons-threshold (* 20 1000 1000))
#+end_src

* Emacs Profile
*.config/guix/manifests/emacs.scm*

#+begin_src scheme :tangle .config/guix/manifests/emacs.scm :noweb yes :noweb-ref nil :mkdirp yes
  (specifications->manifest
   '("emacs"
     ;;"emacs-native-comp"
     <<packages>>
  ))
#+end_src

* Local Variables
# Local Variables:
# before-save-hook: (org-make-toc)
# End:
