.emacs.d/init.el

(use-package openwith
  :after dired
  :hook (dired-mode . openwith-mode)
  :config
  (setq openwith-associations
        (list
         (list (openwith-make-extension-regexp
                '("mpg" "mpeg" "mp3" "mp4"
                  "avi" "wmv" "wav" "mov" "flv"
                  "ogm" "ogg" "mkv"))
               "mpv"
               '(file))
         (list (openwith-make-extension-regexp
                '("pdf"))
               "zathura"
               '(file))
         (list (openwith-make-extension-regexp
                '("xbm" "pbm" "pgm" "ppm" "pnm"
                  "png" "gif" "bmp" "tif" "jpeg")) ;; Removed jpg because Telega uses it
               "vimiv"
               '(file)))))

(use-package telega
  ;; :straight (telega :host github
  ;;                   :branch "master")
  :commands telega
  :custom
  (telega-completing-read-function 'completing-read)
  :config
  (define-key global-map (kbd "C-c t") telega-prefix-map)
  (telega-appindicator-mode 1))

(use-package erc
    :commands erc
    :config
    ;; general setup
    (setq erc-server "irc.libera.chat"
          erc-nick "luishgh"
          erc-user-full-name "Luis Henrique"
          erc-kill-buffer-on-part t
          erc-auto-query 'bury
          erc-autojoin-channels-alist '(("libera.chat" "#systemcrafters")))

    ;; visual config
    (setq erc-fill-column 120
          erc-fill-function 'erc-fill-static
          erc-fill-static-center 20)

    ;; friends
    (setq erc-pals '("diegovsky"))

    ;; tracking config
    (setq erc-track-exclude '("#emacs" "#guix")
          erc-track-exclude-types '("JOIN" "NICK" "PART" "QUIT" "MODE" "AWAY")
          erc-track-exclude-server-buffer t
          erc-track-shorten-start 8
          erc-track-visibility nil))

(defun lhgh/connect-irc ()
  (interactive)
  (erc-tls
   :server "irc.libera.chat" :port 7000
   :nick "luishgh" :password (password-store-get "irc/irc.libera.chat")))

(use-package elcord
  :straight t
  :custom
  (elcord-display-buffer-details nil)
  :config
  (elcord-mode))

(use-package elpher
  :commands elpher)

(use-package langtool
  :straight t
  :commands langtool-check
  :config
  (setq langtool-language-tool-server-jar "~/.local/bin/LanguageTool-5.3/languagetool-server.jar"))

(require 'lhgh-mail)

(use-package pinentry
  :straight (:source gnu-elpa-mirror)
  :config
  (setq epg-pinentry-mode 'loopback)
  (pinentry-start))

(use-package password-store
  :config
  (setq password-store-password-length 15)
  (auth-source-pass-enable)
  :general
  (lhgh/leader-maps
    "ap" '(:ignore t :which-key "pass")
    "app" '(password-store-copy :which-key "copy password")
    "api" '(password-store-insert :which-key "insert password")
    "apg" '(password-store-generate :which-key "generate password")))

(defun lhgh/lookup-password (&rest keys)
  "Gets the password for the query from .authinfo.gpg."
  (let ((result (apply #'auth-source-search keys)))
    (if result
        (funcall (plist-get (car result) :secret))
        nil)))

;; Make gc pauses faster by decreasing the threshold.
 (setq gc-cons-threshold (* 2 1000 1000))
